[
    {
        "title": "What Ethereum 2.0 Means for Mining Coins",
        "snippet": "Because Ethereum shifted to proof-of-stake in 2022, you cannot mine ether. But you can mine altcoins that use the same algorithm as Ethereum used to, and some ...",
        "highlighted_words": [
            "Ethereum shifted to proof-of-stake in 2022"
        ],
        "position": 1,
        "date": "Dec 15, 2023"
    },
    {
        "title": "2 Stocks to Watch as Ethereum Shows Promise for 2024",
        "snippet": "Per Bitwise Asset Management, the world's largest crypto index fund manager, ETH revenues could double from 2023, up to $5 billion in 2024. Also, a state of ...",
        "highlighted_words": [
            "ETH revenues could double from 2023, up to $5 billion in 2024"
        ],
        "position": 2,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Early Ethereum Backers Cyber.Fund to Invest $100M in ' ...",
        "snippet": "Investment firm cyber.Fund, an early backer in Ethereum, is committing $100 million to projects that intersect blockchain technology with artificial ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 3,
        "date": "Dec 14, 2023"
    },
    {
        "title": "JPMorgan says ether to outperform bitcoin next year",
        "snippet": "Ether will outperform bitcoin and other cryptocurrencies in 2024, thanks to Ethereum's EIP-4844 upgrade, according to JPMorgan analysts.",
        "highlighted_words": [
            "Ether",
            "Ethereum's"
        ],
        "position": 4,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Ethereum burns $2.5B worth of ETH since merge as supply ...",
        "snippet": "Ethereum's deflationary shift intensifies with $2.5 billion in ETH burned post-merge, driving supply to unprecedented lows.",
        "highlighted_words": [
            "Ethereum's",
            "ETH"
        ],
        "position": 5,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Ethereum's Buterin Floats Prospect of Taking Some Layer- ...",
        "snippet": "Vitalik Buterin, a member of the Ethereum Foundation's executive board, once pushed \"layer-2\" networks as a way to provide faster and cheaper transactions.",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 6,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Ethereum Community Approves ERC3643 as the First ...",
        "snippet": "We are proud to announce that the ERC3643 standard has reached 'Final' status in its Ethereum Improvement Proposal (EIP). This status solidifies ERC3643 as the ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 7,
        "date": "Dec 14, 2023"
    },
    {
        "title": "JPMorgan Chase predicts that Ethereum will surpass ...",
        "snippet": "According to TechFlow, JPMorgan Chase expects Ethereum to outperform Bitcoin and other cryptocurrencies in 2024, although the bank remains “cautious” about ...",
        "highlighted_words": [
            "JPMorgan Chase expects Ethereum to outperform Bitcoin and other cryptocurrencies in 2024"
        ],
        "position": 8,
        "date": "Dec 13, 2023"
    },
    {
        "title": "SIX Digital Exchange (SDX) tokenizes ethereum stocks in ...",
        "snippet": "SDX tokenized a private company's stocks in its depository (CSD). The stocks had already been tokenized on public ethereum.",
        "highlighted_words": [
            "ethereum"
        ],
        "position": 9,
        "date": "Dec 12, 2023"
    },
    {
        "title": "PulseChain Unleashes Interoperability - Markets Insider",
        "snippet": "PulseChain, the blockchain platform, has introduced a groundbreaking interoperability feature, allowing seamless trading between the Pulse and Ethereum networks ...",
        "highlighted_words": [
            "PulseChain, the blockchain platform, has introduced a groundbreaking interoperability feature"
        ],
        "position": 10,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Solana NFT Sales Overtake Ethereum for the First Time ...",
        "snippet": "Solana's NFT sales volume surpassed that of Ethereum in December 2023, marking the first time this has occurred.",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 11,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Peter Brandt Stirs Debate with Harsh Critique of Ethereum",
        "snippet": "Market expert Peter Brandt questions Ethereum's viability compared to Bitcoin, citing high gas fees and structural issues.",
        "highlighted_words": [
            "Ethereum's viability compared to Bitcoin"
        ],
        "position": 12,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Ethereum Will Outperform Bitcoin in Next Year: JPMorgan",
        "snippet": "Analysts from JPMorgan, one of the biggest asset management and finance firms, believe that Ethereum (ETH) will likely outperform Bitcoin next year.",
        "highlighted_words": [
            "Ethereum (ETH) will likely outperform Bitcoin next year"
        ],
        "position": 13,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Vitalik Buterin Supports Integrating Zero-Knowledge Ethereum ...",
        "snippet": "In a new post, the Ethereum co-founder laid out the benefits and challenges of an “enshrined” ZK-EVM to improve security and speed.",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 14,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Singapore licenses Ethereum-based exchange - DigFin",
        "snippet": "Singapore licenses Ethereum-based exchange. MAS graduates DigiFT from its sandbox as a regulated exchange that settles trades on Ethereum. Published.",
        "highlighted_words": [
            "Singapore licenses Ethereum-based exchange"
        ],
        "position": 15,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Why Is Ethereum Price Down To $2200 Today?",
        "snippet": "The Ethereum price has been among the worst hit in the flash crash that took place on Monday. The crash sent the asset's price down below $2,200 for the ...",
        "highlighted_words": [
            "The Ethereum price has been among the worst hit in the flash crash that took place on Monday"
        ],
        "position": 16,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Ethereum ETH Price News Today - Technical Analysis Update ...",
        "snippet": "... Ethereum ETH Price News Today - Technical Analysis Update and Price Now! In this video I talk about a technical analysis of the Ethereum Price and I talk ...",
        "highlighted_words": [],
        "position": 17,
        "date": ""
    },
    {
        "title": "NFTs Are Dead? Solana Outpaces Ethereum for NFT Sales",
        "snippet": "Solana is having a moment in the sun, with breakneck increase in SOL's price, rocketing TVL, and now a significant win in NFT sales.",
        "highlighted_words": [
            "Solana is having a moment in the sun"
        ],
        "position": 18,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Vitalik Smart Gas (VSG) launches on Ethereum Chain. ...",
        "snippet": "California City, CA, Dec. 14, 2023 (GLOBE NEWSWIRE) -- VSG proudly announces the launch of Vitalik Smart Gas (VSG), a pioneering gas token designed ...",
        "highlighted_words": [],
        "position": 19,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Ether Capital Announces Leadership Transition: Brian ...",
        "snippet": "Ether Capital Announces Leadership Transition: Brian Mosoff to Step Down as CEO, Som Seif Appointed as Interim CEO, Update on Corporate Treasury and NCIB. Share ...",
        "highlighted_words": [
            "Brian Mosoff to Step Down as CEO"
        ],
        "position": 20,
        "date": "Dec 11, 2023"
    },
    {
        "title": "If You Held On for Dear Life, It's a Merry Cryptomas!",
        "snippet": "Bitcoin is up 167% year-to-date. Ethereum is up 91%. If a massive crypto rally was one of your predictions for 2023 a year ago, I take my hat off to you.",
        "highlighted_words": [
            "Ethereum is up 91"
        ],
        "position": 21,
        "date": "Dec 16, 2023"
    },
    {
        "title": "Ethereum sees major shift from centralized exchanges to ...",
        "snippet": "In 2023, Ethereum saw a clear transition away from centralized exchanges. While the reduction in exchange-held ETH suggests a movement towards DeFi platforms ...",
        "highlighted_words": [
            "Ethereum saw a clear transition away from centralized exchanges"
        ],
        "position": 22,
        "date": "Dec 13, 2023"
    },
    {
        "title": "NFT's Skyrocketing!🔥Ethereum Coming To Magic Eden ...",
        "snippet": "We are seeing an explosion of activity across all the surfaces on Magic Eden because we support all the major chains.",
        "highlighted_words": [],
        "position": 23,
        "date": ""
    },
    {
        "title": "Ethereum Price Prediction As Post-Correction Rally Sets ...",
        "snippet": "Ethereum Price Prediction As Post-Correction Rally Sees 15% Jump Ahead · Channel Pattern Hints Next Jump Above $2500 · Can ETH Price Fall Back to $2000.",
        "highlighted_words": [
            "Ethereum Price Prediction As Post-Correction Rally Sees 15% Jump Ahead"
        ],
        "position": 24,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Vesting in crypto, explained",
        "snippet": "The most recent news about crypto industry at Cointelegraph. Latest news about bitcoin, ethereum, blockchain, mining, cryptocurrency prices and more.",
        "highlighted_words": [
            "Latest news about bitcoin, ethereum"
        ],
        "position": 25,
        "date": "Dec 16, 2023"
    },
    {
        "title": "Bitcoin, Ethereum, Dogecoin Santa Rallies Make A Pit Stop",
        "snippet": "Although Bitcoin, Ethereum and Dogecoin showed weakness compared to the stock market in terms of price action, their lower moves were taking place on declining ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 26,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Crypto Partner Hub",
        "snippet": "We've partnered up with two of the leading digital asset platforms to give you access to a wide range of cryptocurrencies and advanced crypto trading features.",
        "highlighted_words": [],
        "position": 27,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Sepolia vs Holesky - Comparing Ethereum Testnets",
        "snippet": "Holesky was launched in September 2023 as the latest Ethereum testnet, replacing Goerli. It serves as a network for testing validation and staking and is open ...",
        "highlighted_words": [
            "Holesky was launched in September 2023 as the latest Ethereum testnet"
        ],
        "position": 28,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Cryptocurrency Prices, Charts, Daily Trends, Market Cap, ...",
        "snippet": "View crypto prices and charts, including Bitcoin, Ethereum, XRP, and more. Earn free crypto. Market highlights including top gainer, highest volume, ...",
        "highlighted_words": [
            "View crypto prices and charts"
        ],
        "position": 29,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Cryptocurrencies: Bitcoin Slips to $41K",
        "snippet": "This weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We've also included XRP.",
        "highlighted_words": [
            "ether"
        ],
        "position": 30,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Coti plans expansion to Ethereum ecosystem with Layer 2 ...",
        "snippet": "Cardano-focused development firm Coti plans to launch an Ethereum Layer 2 in an upcoming upgrade scheduled for release in 2024.",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 31,
        "date": "Dec 13, 2023"
    },
    {
        "title": "RSK (RBTC): What It Is and How It Works",
        "snippet": "Ethereum, in particular, has experienced large \"gas fee\" increases—\"gas\" is the term used by the Ethereum community for transaction fees and was adopted by RSK.",
        "highlighted_words": [
            "Ethereum, in particular, has experienced large \"gas fee\" increases"
        ],
        "position": 32,
        "date": "Dec 16, 2023"
    },
    {
        "title": "Block size and scalability, explained",
        "snippet": "The most recent news about crypto industry at Cointelegraph. Latest news about bitcoin, ethereum, blockchain, mining, cryptocurrency prices and more.",
        "highlighted_words": [
            "Latest news about bitcoin, ethereum"
        ],
        "position": 33,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Bitcoin and Ethereum Drop As Traders Get Liquidated",
        "snippet": "Over $400 million worth of positions liquidated in the last 24 hours across BTC and ETH. · Bitcoin and Ethereum decreased by 11% as key resistance was reached.",
        "highlighted_words": [
            "ETH",
            "Ethereum"
        ],
        "position": 34,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Galaxy Digital CEO Mike Novogratz Says He Was 'Dead ...",
        "snippet": "Galaxy Digital founder and CEO Mike Novogratz has admitted that his past perception of XRP and Ripple was “dead wrong.”",
        "highlighted_words": [
            "Galaxy Digital founder and CEO Mike Novogratz"
        ],
        "position": 35,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Bitcoin Trades Above $41K, Ether Stays Below $2200 ...",
        "snippet": "3.0 TV is a news channel which gives you the latest news on blockchain and cryptocurrency on a daily basis which include Bitcoin (BTC), Ethereum, LUNA, UST, ...",
        "highlighted_words": [],
        "position": 36,
        "date": ""
    },
    {
        "title": "Grayscale Ethereum Trust(ETHE) Stock Options Chain",
        "snippet": "Track real-time Grayscale Ethereum Trust(ETHE) stock options chain data and pricing information and news on moomoo App for your options trading and ...",
        "highlighted_words": [
            "Grayscale Ethereum Trust(ETHE) stock options chain"
        ],
        "position": 37,
        "date": "Dec 12, 2023"
    },
    {
        "title": "The magnificence of objectivity and a couple of solid proofs",
        "snippet": "Raphael Steiner received his doctorate in mathematics at the age of 21. Now the Swiss National Science Foundation is funding his research at ETH Zurich in ...",
        "highlighted_words": [
            "ETH"
        ],
        "position": 38,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Crypto News: Bitcoin Price, SOL Rally, ETH, PYTH, HNT ...",
        "snippet": "Crypto News: Bitcoin Price, SOL Rally, ETH, PYTH, HNT & MORE!! 90K views · 1 year ago #Cryptonews #Bitcoin #News ...more ...",
        "highlighted_words": [],
        "position": 39,
        "date": ""
    },
    {
        "title": "CompagOs Is Now an ETH Spin-Off",
        "snippet": "We are pleased to announce that CompagOs is now officially an ETH Zurich spin-off. ETH Zurich is one of the world's best universities.",
        "highlighted_words": [
            "CompagOs is now officially an ETH Zurich spin-off"
        ],
        "position": 40,
        "date": "Dec 15, 2023"
    },
    {
        "title": "How to buy Ethereum in Singapore",
        "snippet": "You can buy Ethereum on Revolut's crypto platform. Create your free account and top up your balance to buy 130+ cryptocurrencies, including ETH.",
        "highlighted_words": [
            "Ethereum",
            "ETH"
        ],
        "position": 41,
        "date": "10 hours ago"
    },
    {
        "title": "Future of Financial Services | DTCC Digital Assets",
        "snippet": "... News and Events. DTCC Connection · Latest News · Industry Connection · White Papers · Life at DTCC · Podcasts · Our Experts · Events · Press Room. About. About ...",
        "highlighted_words": [
            "News",
            "News"
        ],
        "position": 42,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Horizen Labs, Offchain Labs, and the Arbitrum Foundation ...",
        "snippet": "... Ethereum NFT ecosystem. Meanwhile, APE hasnt had the best year and it's down ... NewsLearning CenterWalletVerse DEXList in Wallet & MarketsBitcoin Cash Register.",
        "highlighted_words": [
            "Ethereum",
            "News"
        ],
        "position": 43,
        "date": "Dec 12, 2023"
    },
    {
        "title": "BTC, ETH, and XRP Price Analysis for December 11",
        "snippet": "Ethereum is trading at $2,224 at press time. XRPUSD. XRP is not an exception to the rule, falling by 5.89% since ... Realtime news. More realtime news.",
        "highlighted_words": [
            "Ethereum",
            "news",
            "news"
        ],
        "position": 44,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Bad Timing For Sam Bankman-Fried? Here's How Much ...",
        "snippet": "Bitcoin news portal providing breaking news, guides, price ... All Altcoin News · Tech · Blockchain · Security · FinTech; Price. Bitcoin Price · Ethereum Price ...",
        "highlighted_words": [
            "news",
            "news",
            "News",
            "Ethereum"
        ],
        "position": 45,
        "date": "Dec 14, 2023"
    },
    {
        "title": "ETH to ETH (BASE) Crypto Exchange | Convert Ethereum ...",
        "snippet": "iOS and Android wallet for Ethereum (BASE) →. hatikorgi. Try our mobile app NOW. googleplay icon android-apk icon. Company. toggle. About Us · Blog & News ...",
        "highlighted_words": [
            "Ethereum",
            "News"
        ],
        "position": 46,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Artificial intelligence for safer bike helmets and better shoe ...",
        "snippet": "12.12.2023 by ETH News editorial team · volume_upRead; mode_comment Number of comments. shareShare. Twitter; Facebook; Linkedin; emailEmail; linkCopy link. AI ...",
        "highlighted_words": [
            "ETH News"
        ],
        "position": 47,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Thailand's Cryptocurrency Exchange | Buy bitcoin",
        "snippet": "Buy Bitcoin Sell Bitcoin, Thailand's Bitcoin Exchange. บริการซื้อ บิทคอยน์ ขาย บิทคอยน์ เหรียญคริปโต From Thai Baht to Bitcoin. Cryptocurrency: Bitcoin, Ethereum ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 48,
        "date": "Dec 15, 2023"
    },
    {
        "title": "Foam - About",
        "snippet": "FOAM secures physical space on the blockchain, harnessing the power of Ethereum ... News mentions. View more. No news found. Related projects. Geodnet ...",
        "highlighted_words": [
            "Ethereum",
            "News",
            "news"
        ],
        "position": 49,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Jilin Yida Conducts Emergency Rescue Drill",
        "snippet": "latest company news about Jilin Yida Conducts Emergency Rescue Drill 0 ... Ether Supplier. Copyright © -2025 Jiangsu Yida Chemical Co., Ltd. . All Rights ...",
        "highlighted_words": [
            "news",
            "Ether"
        ],
        "position": 50,
        "date": "Dec 15, 2023"
    },
    {
        "title": "LavaMoat and the Ledger Software Supply Chain Attack",
        "snippet": "This library is included in a live-updating manner via a Content Delivery Network (CDN) in many web apps in the Ethereum ecosystem. ... Latest articles. All news.",
        "highlighted_words": [
            "Ethereum",
            "news"
        ],
        "position": 51,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Liquidation Heatmap: Bitcoin & Altcoins",
        "snippet": "Market News. Tools. Crypto Emission Rate Free · Bitcoin vs Gold Free · ETF ... Ethereum · ADA/USDT. Cardano · AVAX/USDT. Avalanche · BNB/USDT. Binance Coin · DOGE ...",
        "highlighted_words": [
            "News",
            "Ethereum"
        ],
        "position": 52,
        "date": "Dec 13, 2023"
    },
    {
        "title": "GMT price today, GMT to USD live price, marketcap and chart",
        "snippet": "GMT price. GMT. #257 · GMT to USD Chart · GMT statistics · GMT to USD converter · GMT Markets · GMT News · GMT community · GMT Token Unlocks · GMT analytics.",
        "highlighted_words": [
            "News"
        ],
        "position": 53,
        "date": "1 hour ago"
    },
    {
        "title": "Donald Trump Launches New Mugshot Edition NFT ...",
        "snippet": "Blockchain News · Bitcoin News · Binance News · Ethereum News · XRP News · Altcoins News · Token Sales News · Technology · Artificial Intelligence · Big Data ...",
        "highlighted_words": [
            "Ethereum News"
        ],
        "position": 54,
        "date": "Dec 13, 2023"
    },
    {
        "title": "What is Ethereum: The world's first programmable blockchain",
        "snippet": "Launched in July 2015, Ethereum (ETH) is a decentralized, open-source blockchain that introduced smart contract functionality for the first time.",
        "highlighted_words": [
            "Ethereum",
            "ETH"
        ],
        "position": 55,
        "date": ""
    },
    {
        "title": "Ethereum: news dal prezzo | A breve nuova spinta rialzista ...",
        "snippet": "Ethereum: news dal prezzo | A breve nuova spinta rialzista? Analisi. Ethereum sta oscillando entro i binari tecnici previsti. L'arretramento attuale era ...",
        "highlighted_words": [
            "Ethereum",
            "news"
        ],
        "position": 56,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Cryptocurrencies had a calm weekend. Bitcoin was priced ...",
        "snippet": "News · Bookmarked and Liked · Creator Center · Settings. Explore the latest crypto ... #Ethereum #ETH #Kriptopara #Vitalik. 10h. Terra Classic zincirinde stake ...",
        "highlighted_words": [
            "News",
            "Ethereum",
            "ETH"
        ],
        "position": 57,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Ultime Ethereum News Oggi | Invezz Notizie",
        "snippet": "Leggi le ultime Ethereum news e notizie di mercato in tempo reale · Il prezzo di Pi Network è crollato da 3 dollari a febbraio a 0,67 dollari. · Il declino è ...",
        "highlighted_words": [
            "Ethereum news"
        ],
        "position": 58,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Frequently Asked Questions | FAQ",
        "snippet": "Micro Gold (MGC). Copper (HG), Platinum (PLN). Micro Bitcoin (MBT), Micro Ether (MET) ... News · Status Updates · Economic Calendar · Newsletter · Extras.",
        "highlighted_words": [
            "Ether",
            "News"
        ],
        "position": 59,
        "date": "Dec 16, 2023"
    },
    {
        "title": "Elon Musk's GROK AI Calls Dogecoin The 'Ultimate Meme ...",
        "snippet": "News · Price · Ethereum · Ripple · Litecoin · EOS. Categories. Blockchain · Security · FinTech · Technology · Trending · Breaking News · Press Releases · How to ...",
        "highlighted_words": [
            "News",
            "Ethereum",
            "News"
        ],
        "position": 60,
        "date": "Dec 11, 2023"
    },
    {
        "title": "2DAI.io Token Price, Charts & Market Insights",
        "snippet": "Stay updated with the latest 2DAI.io token price, charts, and market trends. Dive deep into comprehensive cryptocurrency news and insights on our platform.",
        "highlighted_words": [
            "news"
        ],
        "position": 61,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Harga AirSwap Hari Ini | AST to IDR = 1.192",
        "snippet": "AirSwap adalah protokol trading terdesentralisasi (DEX) yang memanfaatkan jaringan peer-to-peer (P2P) di atas Ethereum. ... News. BeinCrypto Indonesia · 25 ...",
        "highlighted_words": [
            "Ethereum",
            "News"
        ],
        "position": 62,
        "date": "Dec 11, 2023"
    },
    {
        "title": "It's Not Just Electricity And Water — Bitcoin Mines Use A ...",
        "snippet": "That's what the next biggest cryptocurrency network, Ethereum, accomplished last year. ... Established in 2012, Bitcoin Magazine is the oldest and most ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 63,
        "date": "22 hours ago"
    },
    {
        "title": "US-Militär greifen von Huthi kontrollierten Öl-Hafen im ...",
        "snippet": "Top News · Börsenforum · Newsletter · Trading-Konto eröffnen · News · Top News · Börsen ... Ethereum Kurs (Dollar / USD) · Tether Kurs (Dollar / USD) · USD Coin ...",
        "highlighted_words": [
            "News",
            "News",
            "News",
            "Ethereum"
        ],
        "position": 64,
        "date": "Dec 15, 2023"
    },
    {
        "title": "1 oz Gold Bars",
        "snippet": "... Ethereum. $1,801.12 -2.24 · Litecoin. $86.59 -0.10. Dash. $22.57 0.08. XRP ... News. Keith ...",
        "highlighted_words": [
            "Ethereum",
            "News"
        ],
        "position": 65,
        "date": "20 hours ago"
    },
    {
        "title": "0.6871 CTC USDT Perpetual Swap",
        "snippet": "Connect Ethereum and X Layer. Institutional. Institutional home. The world's ... Our latest institutional trading research, news, and more · Learn. More.",
        "highlighted_words": [
            "Ethereum",
            "news"
        ],
        "position": 66,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Rio Tinto PLC Share Price (Live",
        "snippet": "Ethereum · Cardano · Solana · Dogecoin · OFFICIAL TRUMP · Currency Converter · BTC ... Rio Tinto PLC News & Analysis. Recent; Earnings; Transcripts; Company ...",
        "highlighted_words": [
            "Ethereum",
            "News"
        ],
        "position": 67,
        "date": "Dec 12, 2023"
    },
    {
        "title": "0.004589 TURBO USDT Perpetual Swap",
        "snippet": "Connect Ethereum and X Layer. Institutional. Institutional home. The world's ... Our latest institutional trading research, news, and more · Learn. More.",
        "highlighted_words": [
            "Ethereum",
            "news"
        ],
        "position": 68,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Cardanon perustaja ennustaa Ethereumin loppua 15 ...",
        "snippet": "FI /fi/news/cryptocurrency-news/show/230283-cardano-founder-predicts-end ... Ethereum (ETH) · Shiba Inu (SHIB) · XRP (Ripple) · Dogecoin (DOGE) · Litecoin (LTC) ...",
        "highlighted_words": [
            "news",
            "news",
            "Ethereum",
            "ETH"
        ],
        "position": 69,
        "date": "Dec 15, 2023"
    },
    {
        "title": "ETH/BTC-suhde ennätyksellisen alhaalla sitten vuoden 2020",
        "snippet": "Viimeisen vuoden aikana pari on laskenut yli 67 %, raportoi Crypto News. Bitcoin on noussut 34 % vuoden aikana, kun taas Ethereum on laskenut 50 %, mikä ...",
        "highlighted_words": [
            "News",
            "Ethereum"
        ],
        "position": 70,
        "date": "Dec 15, 2023"
    },
    {
        "title": "ADT Inc berichtet über die Ergebnisse für das am 31. März ...",
        "snippet": "... , um diese News lesen zu können. Los gehts. Auf den Supercharts analysieren. Echtzeitnews. Weitere Echtzeitnews. Weitere News von Reuters. Weitere Neuigkeiten.",
        "highlighted_words": [
            "News",
            "News"
        ],
        "position": 71,
        "date": "Dec 11, 2023"
    },
    {
        "title": "GTPool.io",
        "snippet": "UBQ and HYP are GPU only. Feel free to ask any questions in our Telegram chat; Stay in tune and subscribe to official Telegram News channel. Как начать. Для ...",
        "highlighted_words": [
            "News"
        ],
        "position": 72,
        "date": "Dec 12, 2023"
    },
    {
        "title": "TROLL zu THB",
        "snippet": "KuCoin ist eine globale Börse für Kryptowährungen, mit der man sicher und einfach Börsen wie Bitcoin, Altcoin, Ethereum usw. kaufen, verkaufen und lagern ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 73,
        "date": "Dec 13, 2023"
    },
    {
        "title": "CLANKER zu ILS",
        "snippet": "KuCoin ist eine globale Börse für Kryptowährungen, mit der man sicher und einfach Börsen wie Bitcoin, Altcoin, Ethereum usw. kaufen, verkaufen und lagern ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 74,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Cara Mendaftar Crypto Exchange Di 2024",
        "snippet": "Anda harus memilih mata uang atau aset kripto yang ingin Anda deposit ke akun crypto exchange Anda, seperti rupiah, dolar, Bitcoin, Ethereum, atau lainnya. Anda ...",
        "highlighted_words": [
            "Ethereum"
        ],
        "position": 75,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Crypto on a Budget: Your Guide to Low-Fee Trading Options",
        "snippet": "Ethereum Apps To Create New Version Of Technology. Follow Us on ... You can be the first to find out the latest news and tips about trading, markets...",
        "highlighted_words": [
            "Ethereum",
            "news"
        ],
        "position": 76,
        "date": "Dec 11, 2023"
    }
]