[
    {
        "title": "Bitcoin could support renewable energy development",
        "snippet": "A new study calculated renewable energy projects' potential to profit from bitcoin mining during the precommercial development phase, when a wind or solar ...",
        "highlighted_words": [
            "bitcoin"
        ],
        "position": 1,
        "date": "Nov 27, 2023"
    },
    {
        "title": "Every Bitcoin payment 'uses a swimming pool of water'",
        "snippet": "Every Bitcoin transaction uses, on average, enough water to fill a back yard swimming pool, a new study suggests. That's around six million times more than is ...",
        "highlighted_words": [
            "Every Bitcoin transaction uses, on average, enough water to fill a back yard swimming pool"
        ],
        "position": 2,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Bitcoin Cash Price, BCH Price, Live Charts, and Marketcap",
        "snippet": "Get the latest price, news, live charts, and market trends about Bitcoin Cash. The current price of Bitcoin Cash in United States is $348.91 per (BCH / USD)",
        "highlighted_words": [
            "Get the latest price, news, live charts, and market trends"
        ],
        "position": 3,
        "date": "3 hours ago"
    },
    {
        "title": "Polluting Bitcoin mines come to rural Georgia",
        "snippet": "Cleanspark's Bitcoin boom in rural Georgia, backed by Wall Street giants, raises environmental and social concerns challenging the promised benefits to rural ...",
        "highlighted_words": [
            "Cleanspark's Bitcoin boom in rural Georgia"
        ],
        "position": 4,
        "date": "Nov 27, 2023"
    },
    {
        "title": "How Bitcoin Mining Impacts Climate, Water and Land",
        "snippet": "The water footprint of BTC mining is significant, amounting to about 1.65 cubic kilometers (km3) from 2020 to 2021.",
        "highlighted_words": [],
        "position": 5,
        "date": "Nov 27, 2023"
    },
    {
        "title": "Coincover's crypto news update [27/11/2023]",
        "snippet": "Bitcoin, the largest cryptocurrency by market value, experienced an increase in its price last Friday. It reached levels that haven't been seen since May 2022.",
        "highlighted_words": [
            "Bitcoin, the largest cryptocurrency by market value"
        ],
        "position": 6,
        "date": "Nov 27, 2023"
    },
    {
        "title": "BM&F Bitcoin Currency Futures - Apr 25 (BITc1)",
        "snippet": "Crypto stocks set to start December on high note as bitcoin hits near 19-month high. (Reuters) -Shares of crypto miners and bitcoin-tracking companies rose ...",
        "highlighted_words": [
            "Crypto",
            "bitcoin",
            "crypto",
            "bitcoin"
        ],
        "position": 7,
        "date": "Dec 1, 2023"
    },
    {
        "title": "Crypto Pundit Reveals Why Bitcoin Is Worth As Much As ...",
        "snippet": "A crypto pundit and Bitcoin maximalist, Mark Harvey, has explained why he believes the foremost cryptocurrency Bitcoin, is far off from its true potential.",
        "highlighted_words": [
            "crypto",
            "Bitcoin",
            "cryptocurrency Bitcoin"
        ],
        "position": 8,
        "date": "Dec 1, 2023"
    },
    {
        "title": "Bitcoin Remains on Track for $100K by Year-End 2024",
        "snippet": "Bitcoin Remains on Track for $100K by Year-End 2024: Standard Chartered. An earlier-than-expected spot bitcoin ETF in the U.S. could be the key catalyst, said ...",
        "highlighted_words": [
            "Bitcoin Remains on Track for $100K by Year-End 2024"
        ],
        "position": 9,
        "date": "Nov 28, 2023"
    },
    {
        "title": "New crypto front emerges in Israel's militant financing fight",
        "snippet": "A new front has emerged in Israel's fight against the funding of Iran-backed militant groups from Hamas to Hezbollah: A fast-growing crypto network called ...",
        "highlighted_words": [
            "crypto"
        ],
        "position": 10,
        "date": "11 hours ago"
    },
    {
        "title": "CoinChoose.com - Latest Crypto Prices, Trends, News in 2025",
        "snippet": "Explore the implications of the 2024 Bitcoin halving on the cryptocurrency market, examining past trends and future predictions.",
        "highlighted_words": [
            "Explore the implications of the 2024 Bitcoin halving"
        ],
        "position": 11,
        "date": "Nov 27, 2023"
    },
    {
        "title": "Blackrock Proposes 'Revised In-Kind Model' for Spot ...",
        "snippet": "Blackrock, the world's largest asset manager, has proposed a revised in-kind model for its spot bitcoin ETF to resolve the SEC's concerns.",
        "highlighted_words": [
            "Blackrock, the world's largest asset manager"
        ],
        "position": 12,
        "date": "Nov 30, 2023"
    },
    {
        "title": "11th anniversary of Bitcoin's first halving: From $12 to $37000",
        "snippet": "Bitcoin experienced its first-ever halving 11 years ago today, and since then, it has soared from $12 to its current price of $37,000. 9047 Total views.",
        "highlighted_words": [
            "Bitcoin experienced its first-ever halving 11 years ago today"
        ],
        "position": 13,
        "date": "Nov 28, 2023"
    },
    {
        "title": "SoFi Shuts Crypto Services. Here's What Customers Need ...",
        "snippet": "SoFi Technologies will shut down its crypto services by Dec. 19. Existing accounts will have the choice to migrate to the Blockchain.com platform or be ...",
        "highlighted_words": [
            "crypto"
        ],
        "position": 14,
        "date": "Nov 29, 2023"
    },
    {
        "title": "CNBC Host Jim Cramer Is Now Bullish on Bitcoin",
        "snippet": "Jim Cramer, the host of CNBC's Mad Money, has reversed his opinion on Bitcoin and is now urging investors to reconsider their positions.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 15,
        "date": "Nov 27, 2023"
    },
    {
        "title": "A single bitcoin transaction uses enough water to fill ...",
        "snippet": "Buying or selling bitcoin uses 16,000 litres of clean water for every single transaction, which could exacerbate existing droughts around the world.",
        "highlighted_words": [
            "Buying or selling bitcoin uses 16,000 litres of clean water for every single transaction"
        ],
        "position": 16,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Bitcoin ecological problems: Why does Bitcoin use so much ...",
        "snippet": "Every Bitcoin transaction uses on average almost the same amount of water that is needed to fill a backyard swimming pool and that's the conclusion of a ...",
        "highlighted_words": [],
        "position": 17,
        "date": ""
    },
    {
        "title": "Charlie Munger: the aphorism-loving, bitcoin-hating sage ...",
        "snippet": "Munger, who has died at 99, won fans for a quick wit that cut much of the business world down to size.",
        "highlighted_words": [],
        "position": 18,
        "date": "Nov 29, 2023"
    },
    {
        "title": "FutureBit Announces Apollo II Line of Personal Miners",
        "snippet": "FutureBit, a renowned innovator in consumer-centric Bitcoin products, today announced the Apollo II, a revolutionary personal home mining device.",
        "highlighted_words": [
            "Apollo II"
        ],
        "position": 19,
        "date": "Nov 29, 2023"
    },
    {
        "title": "A decision support system using signals from social media ...",
        "snippet": "We design, implement, and evaluate a decision support system that combines fine-grained signals derived from news and social media with bitcoin prices.",
        "highlighted_words": [
            "news",
            "bitcoin"
        ],
        "position": 20,
        "date": ""
    },
    {
        "title": "Bitcoin Futures Trading",
        "snippet": "Bitcoin futures are based on the Bitcoin digital cryptocurrency. They allow you to trade your view on the price and future performance of this volatile market.",
        "highlighted_words": [
            "Bitcoin futures are based on the Bitcoin digital cryptocurrency"
        ],
        "position": 21,
        "date": "Nov 29, 2023"
    },
    {
        "title": "BITO hits asset peak as possible spot bitcoin ETF approval ...",
        "snippet": "The ProShares Bitcoin Strategy ETF (BITO) reached $1.47 billion assets under management on Tuesday — its highest mark ever.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 22,
        "date": "Nov 29, 2023"
    },
    {
        "title": "The impact of macroeconomic news on the psyche ...",
        "snippet": "The article delves into the role played by macroeconomic news in investor psychology, analyzing global events and market reactions.",
        "highlighted_words": [
            "news"
        ],
        "position": 23,
        "date": "Nov 30, 2023"
    },
    {
        "title": "Cristiano Ronaldo faces $1 billion lawsuit after promoting ...",
        "snippet": "Cristiano Ronaldo faces a $1 billion class-action lawsuit for promoting cryptocurrency-related NFTs, issued by cryptocurrency exchange Binance.",
        "highlighted_words": [
            "Cristiano Ronaldo faces a $1 billion class-action lawsuit"
        ],
        "position": 24,
        "date": "Nov 30, 2023"
    },
    {
        "title": "Bitcoin surges 2.87% to its highest level this year",
        "snippet": "Bitcoin rallied to its highest price in 2023 as the cryptocurrency jumped 2.87% to a high of $38,834 on Friday. The surge in Bitcoin's value marks its peak ...",
        "highlighted_words": [
            "Bitcoin rallied to its highest price in 2023"
        ],
        "position": 25,
        "date": "Dec 1, 2023"
    },
    {
        "title": "SEC Struggles to Serve Richard Heart in Multi-Billion ...",
        "snippet": "The US Securities and Exchange Commission (SEC) faces challenges in its billion-dollar lawsuit against cryptocurrency figure Richard Heart.",
        "highlighted_words": [
            "faces challenges in its billion-dollar lawsuit"
        ],
        "position": 26,
        "date": "Nov 27, 2023"
    },
    {
        "title": "Bitcoin News - X",
        "snippet": "JUST IN: \"The approval of spot #Bitcoin ETFs could put severe downward pressure on #Bitcoin prices\", says JP Morgan analyst Nikolaos Panigirtzoglou.",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin"
        ],
        "position": 27,
        "date": "Nov 26, 2023"
    },
    {
        "title": "Botanix Labs Launches First EVM-Equivalent Layer 2 ...",
        "snippet": "Botanix Labs has officially launched the first-ever fully decentralized Ethereum Virtual Machine (EVM) equivalent Layer 2 on Bitcoin.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 28,
        "date": "22 hours ago"
    },
    {
        "title": "bitsCrunch Token (BCUT) Price Today, News & Live Chart",
        "snippet": "bitsCrunch Token is a global digital currency exchange offering cryptocurrency trading, advanced tools, and staking options for beginners and experts alike.",
        "highlighted_words": [
            "bitsCrunch Token"
        ],
        "position": 29,
        "date": "13 hours ago"
    },
    {
        "title": "Latest News on Venezuela",
        "snippet": "Read the latest news on Venezuela to learn more about the country, crypto regulations and recent news with our Venezuela news section.",
        "highlighted_words": [
            "Read the latest news on Venezuela"
        ],
        "position": 30,
        "date": "Nov 30, 2023"
    },
    {
        "title": "Amazing News For Bitcoin Mining (Ocean)",
        "snippet": "The real news today that I wanted to share with you is the launch of ocean this is a new Bitcoin mining pool that is based it's basically a reboot.",
        "highlighted_words": [],
        "position": 31,
        "date": ""
    },
    {
        "title": "Fintech firm SoFi set to exit cryptocurrency business",
        "snippet": "The San Francisco-based company said it was ending its crypto services on Dec. 19, and starting Wednesday, new SoFi crypto accounts cannot be opened. The ...",
        "highlighted_words": [
            "crypto",
            "crypto"
        ],
        "position": 32,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Cristiano Ronaldo faces $1bn lawsuit over Binance ads",
        "snippet": "Footballer Cristiano Ronaldo is facing a class action lawsuit in the US over his promotion of Binance, the largest cryptocurrency exchange in the world.",
        "highlighted_words": [
            "Footballer Cristiano Ronaldo is facing a class action lawsuit"
        ],
        "position": 33,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Consumer Alert on Bellavista Bitcoin Bank (BVBB)",
        "snippet": "The Gibraltar Financial Services Commission (GFSC) is issuing a consumer alert regarding BVBB. The firm BVBB claims to be affiliated with the GFSC.",
        "highlighted_words": [
            "BVBB"
        ],
        "position": 34,
        "date": "Dec 1, 2023"
    },
    {
        "title": "GlobaleCrypto Simplifies Bitcoin Mining with Innovative ...",
        "snippet": "This service is tailored to make Bitcoin (BTC) mining more accessible and profitable for a wide range of users, from novices to seasoned crypto enthusiasts.",
        "highlighted_words": [
            "make Bitcoin (BTC) mining more accessible and profitable"
        ],
        "position": 35,
        "date": "Nov 28, 2023"
    },
    {
        "title": "Bitcoin News - X",
        "snippet": "Bitcoin hashrate hits an all-time-high, surpassing 500 exahash per second (EH/s). #Bitcoin “Price follows hashrate,” as @maxkeiser would say…",
        "highlighted_words": [
            "Bitcoin hashrate hits an all-time-high"
        ],
        "position": 36,
        "date": "Nov 25, 2023"
    },
    {
        "title": "Metro Atlanta police warning residents about ...",
        "snippet": "Police in metro Atlanta are issuing an urgent warning after receiving a ton of reports about cryptocurrency scams targeting residents.",
        "highlighted_words": [
            "s target"
        ],
        "position": 37,
        "date": "Dec 1, 2023"
    },
    {
        "title": "Fox News [LIVE] - **Warning** Crypto Currency Scams On ...",
        "snippet": "Police in metro Atlanta are issuing an urgent warning after receiving a ton of reports about cryptocurrency scams targeting residents.",
        "highlighted_words": [],
        "position": 38,
        "date": ""
    },
    {
        "title": "A decision support system using signals from social media ...",
        "snippet": "We design, implement, and evaluate a decision support system that combines fine-grained signals derived from news and social media with bitcoin prices.",
        "highlighted_words": [
            "news",
            "bitcoin"
        ],
        "position": 39,
        "date": ""
    },
    {
        "title": "CoinDesk: Crypto, Bitcoin News - Apps en Google Play",
        "snippet": "CoinDesk es la empresa de medios, eventos, índices y datos más confiable para la criptoeconomía global. Desde 2013, CoinDesk Media ha liderado la historia ...",
        "highlighted_words": [],
        "position": 40,
        "date": "Nov 27, 2023"
    },
    {
        "title": "Bitcoin hovers near $37.8K; ETF approval eyed | Morning ...",
        "snippet": "3.0 TV is a news channel which gives you the latest news on blockchain and cryptocurrency on a daily basis which include Bitcoin (BTC), Ethereum, LUNA, UST, ...",
        "highlighted_words": [],
        "position": 41,
        "date": ""
    },
    {
        "title": "Bitcoin was just 870$.. 😳 . Follow @cryptodaily for daily ...",
        "snippet": "Photo by Crypto Daily | Crypto News | Trading on March 09, 2025. May.",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 42,
        "date": ""
    },
    {
        "title": "CoinMarketCap: Crypto Tracker – Apps on Google Play",
        "snippet": "CMC is the Cryptocurrency Nº1 source for Bitcoin BTC & Crypto news, coin stats and crypto charts. Stay up-to-date with daily live Bitcoin & crypto prices, ...",
        "highlighted_words": [
            "Crypto news"
        ],
        "position": 43,
        "date": "Nov 25, 2023"
    },
    {
        "title": "Crypto News: BTC, ETH, Binance, Banks In Trouble, Altcoins ...",
        "snippet": "Crypto News: BTC, ETH, Binance, Banks In Trouble, Altcoins & MORE!! · Comments225.",
        "highlighted_words": [],
        "position": 44,
        "date": ""
    },
    {
        "title": "Bitcoin News",
        "snippet": "Bitcoin News · @BitcoinNewsCom. NEW: Samson Mow gifts the President of Colombia 100,000 sats. Image. Samson Mow · 2:33 AM · Dec 1, 2023.",
        "highlighted_words": [
            "Bitcoin News"
        ],
        "position": 45,
        "date": ""
    },
    {
        "title": "Trust Wallet Encounters Bitcoin Node Issue, Causing ...",
        "snippet": "UNLOCK Blockchain News Desk is fueled by a passionate team of young individuals deeply immersed in the world of Blockchain and Crypto. Our mission? To keep you, ...",
        "highlighted_words": [
            "News",
            "Crypto"
        ],
        "position": 46,
        "date": "Nov 30, 2023"
    },
    {
        "title": "Bitcoin's rise of the little guys: Small investors seize control ...",
        "snippet": "Small investors are flocking to cryptocurrency, particularly Bitcoin ... Business Markets Stocks India News City News Economy Mutual Funds Personal Finance IPO ...",
        "highlighted_words": [
            "cryptocurrency",
            "Bitcoin",
            "News",
            "News"
        ],
        "position": 47,
        "date": "Dec 1, 2023"
    },
    {
        "title": "United States V. Kristijan Krstic, Et Al.",
        "snippet": "title=\"News\" News · Press Releases · Speeches · Videos · Photo Galleries · Blogs ... Bitcoin Trading World, BTC Trader Online, BTC Falcon, Perpetual Energy ...",
        "highlighted_words": [
            "News",
            "News",
            "Bitcoin"
        ],
        "position": 48,
        "date": "Nov 30, 2023"
    },
    {
        "title": "Bitcoin Unbreakable Floor? Analyst Predicts BTC Won't ...",
        "snippet": "With a knack for words and a nose for trends, he has penned pieces for numerous industry player, including AMBCrypto, Blockchain.News, and Blockchain Reporter, ...",
        "highlighted_words": [
            "News"
        ],
        "position": 49,
        "date": "Nov 27, 2023"
    },
    {
        "title": "Bitcoin's on Track to Hit $100000 by End-2024 Amid ' ...",
        "snippet": "Continued drivers included bitcoin's continued dominance of the crypto space and ... Company News · Masthead. Other. Sitemap · Stock quotes by finanzen.net.",
        "highlighted_words": [
            "bitcoin's",
            "crypto",
            "News"
        ],
        "position": 50,
        "date": "Nov 28, 2023"
    },
    {
        "title": "Bitcoin BTC Price News Today - Technical Analysis and Elliott ...",
        "snippet": "Link to the More Trading Online Stocks and Shares Service: https://www.patreon.com/MoreTradingOnline Bitcoin BTC Price News Today - Technical Analysis and ...",
        "highlighted_words": [],
        "position": 51,
        "date": ""
    },
    {
        "title": "The Coin Weekly | Bitcoin | Crypto | News | A normal day in ...",
        "snippet": "thecoinweekly on December 1, 2023: \"A normal day in Ohio #cryptomeme #memes #thecoinweekly #bitcoin #bitcoinmemes\".",
        "highlighted_words": [
            "bitcoin"
        ],
        "position": 52,
        "date": ""
    },
    {
        "title": "Wrapped BEAM Price, Live WBEAM Market Cap and Chart",
        "snippet": "Crypto News · Bitcoin · Altcoin · Ethereum News · Binance Coin News · Cardano News · Solana News · XRP News ... news in the crypto market. Name. E-Mail *. Check ...",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 53,
        "date": "Nov 30, 2023"
    },
    {
        "title": "KAP Games Price: KAP Live Price Chart, Market Cap & ...",
        "snippet": "KAP tokens can be traded on centralized crypto exchanges and decentralized exchanges. The most popular exchange to buy and trade KAP Games is ...",
        "highlighted_words": [
            "crypto"
        ],
        "position": 54,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Charlie Munger's Best One-Liners on Stocks, Bitcoin, the Fed ...",
        "snippet": "It indicates a way to close an interaction, or dismiss a notification. News stocks ... Bitcoin and crypto. 8. On bitcoin when it was trading at $150: \"I ...",
        "highlighted_words": [
            "News",
            "Bitcoin",
            "crypto",
            "bitcoin"
        ],
        "position": 55,
        "date": "Nov 29, 2023"
    },
    {
        "title": "The Bitcoin Breakout is Coming | Bitcoin News Now | Fred ...",
        "snippet": "The Bitcoin Breakout is Coming | Bitcoin News Now | Fred Thiel | Marathon Digital Holdings | MARA Welcome to McNallie Money, your daily dose of Stocks, ...",
        "highlighted_words": [],
        "position": 56,
        "date": ""
    },
    {
        "title": "OSC survey follows up on Canadians' crypto asset ...",
        "snippet": "OSC survey follows up on Canadians' crypto asset knowledge: https://t.co/34pwzX7M8k.",
        "highlighted_words": [
            "crypto"
        ],
        "position": 57,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Stellar Lumens Price, XLM Price, Live Charts, and Marketcap",
        "snippet": "Coinbase Bytes. The week's biggest crypto news, sent right to your inbox ... Bitcoin Cash · The Graph. Comparable market cap. Of all the ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 58,
        "date": "Dec 1, 2023"
    },
    {
        "title": "Jack Dorsey Leads Seed Round in Support of OCEAN'S ...",
        "snippet": "... Bitcoin Mining Globally - Announces Launch at Future of Bitcoin Mining Conference. Ocean logo. News provided by. Mummolin Inc. Nov 28, 2023, 14:00 ET. Share ...",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin",
            "News"
        ],
        "position": 59,
        "date": "Nov 28, 2023"
    },
    {
        "title": "Plataforma de trading de criptomoedas para Bitcoin ...",
        "snippet": "... Bitcoin News: Bitcoin Hits 7-Week Highs, Then Slips Below $94K as Analysts Doubt Immediate $100K Breakout · Ver todas as notícias. Faz trading em movimento. Em ...",
        "highlighted_words": [
            "Bitcoin News"
        ],
        "position": 60,
        "date": "13 minutes ago"
    },
    {
        "title": "Crypto Pundit Predicts When Bitcoin Will Reach A New ATH",
        "snippet": "NewsBTC is a cryptocurrency news service that covers bitcoin news today, technical analysis & forecasts for bitcoin price and other altcoins. Here at ...",
        "highlighted_words": [
            "cryptocurrency news",
            "bitcoin news"
        ],
        "position": 61,
        "date": "Dec 1, 2023"
    },
    {
        "title": "'Technical brains' behind near £110000 cryptocurrency ...",
        "snippet": "More on Cryptocurrencies. Pic: iStock. Crypto prices rally after Trump names Bitcoin and others for US strategic reserve ... Read more from Sky News: UK urged to ...",
        "highlighted_words": [
            "Crypto",
            "Bitcoin",
            "News"
        ],
        "position": 62,
        "date": "Nov 29, 2023"
    },
    {
        "title": "Bitcoin BTC Price News Today | Price Prediction | Technical ...",
        "snippet": "Bitcoin BTC Price News Today | Price Prediction | Technical Analysis Read Full Analysis: ...",
        "highlighted_words": [],
        "position": 63,
        "date": ""
    },
    {
        "title": "Bitcoin: 524.000 Dollar bis 2028! Krypto-Guru „PlanB“ ...",
        "snippet": "Kurzum: Bitcoin-ETF und Bitcoin-Halving – das sind die zwei Säulen, die den ... Er schreibt News, Analysen und Prognosen über digitale Assets und ...",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin",
            "News"
        ],
        "position": 64,
        "date": "Nov 29, 2023"
    },
    {
        "title": "For Traders: Simulated Trading. On Your Rules",
        "snippet": "For Traders.com is a leading prop trading firm offering a Trading Challenge in a simulated trading environment. With raw spreads, low commissions, ...",
        "highlighted_words": [],
        "position": 65,
        "date": "Nov 28, 2023"
    },
    {
        "title": "Epazz Blockchain Technology Software Solutions",
        "snippet": "Epazz blockchain technology solutions focus on enterprise cryptocurrency, mobile apps, and cloud business process software.",
        "highlighted_words": [
            "cryptocurrency"
        ],
        "position": 66,
        "date": "Dec 1, 2023"
    },
    {
        "title": "CRYPTO BOOM LIVE!🔴Terra Luna Classic LUNC, Cronos ...",
        "snippet": "CRYPTO BOOM LIVE! Terra Luna Classic LUNC, Cronos, BITCOIN NEWS! I use this exchange a lot! Great Fees & Rewards. Sign up to claim up to $5000+ USDT on ...",
        "highlighted_words": [],
        "position": 67,
        "date": ""
    },
    {
        "title": "Securities Commission Malaysia | Home",
        "snippet": "The Securities Commission Malaysia, abbreviated SC, a statutory body entrusted with the responsibility of regulating and systematically developing the ...",
        "highlighted_words": [],
        "position": 68,
        "date": "Nov 30, 2023"
    },
    {
        "title": "HUGE CRYPTO NEWS LIVE!🔴Terra Luna Classic, Cronos ...",
        "snippet": "HUGE CRYPTO NEWS LIVE! Terra Luna Classic, Cronos, Binance, Bitcoin! I use this exchange a lot! Great Fees & Rewards. Sign up to claim up to $5000+ USDT on ...",
        "highlighted_words": [],
        "position": 69,
        "date": ""
    },
    {
        "title": "Ad Hoc Group of Bondholders statement on progress in Sri ...",
        "snippet": "Close submenu (News in Focus)News in Focus. Browse All News · Multimedia ... Cryptocurrency · Dividends · Earnings · Earnings Forecasts & Projections · Financing ...",
        "highlighted_words": [
            "News",
            "News",
            "News",
            "Cryptocurrency"
        ],
        "position": 70,
        "date": "Dec 1, 2023"
    },
    {
        "title": "криптовалютна біржа для Bitcoin, Ethereum та альткоїнів",
        "snippet": "Binance – найбільша криптовалютна біржа за обсягом торгівлі, яка обслуговує понад 250 мільйонів користувачів із більш ніж 180 країн світу.",
        "highlighted_words": [],
        "position": 71,
        "date": "3 hours ago"
    }
]