[
    {
        "title": "Cryptoverse: Bitcoin defies its doubters in 2023",
        "snippet": "If 2022 was the year that \"broke bitcoin\", 2023 has been the year of trauma recovery.",
        "highlighted_words": [
            "2023 has been the year of trauma recovery"
        ],
        "position": 1,
        "date": "Dec 12, 2023"
    },
    {
        "title": "David Sencil, Author at Bitcoin News",
        "snippet": "LATEST NEWS · Bitcoin Steady at $93K As Battle With Gold Ensues · Bitdeer Soars, but Scandal Looms—Is the Rally Built on Shaky Ground? · Charting the TRUMP ...",
        "highlighted_words": [
            "Bitcoin Steady at $93K As Battle With Gold Ensues"
        ],
        "position": 2,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Bitcoin's Largest Decline in Four Months Frays Startling Rally",
        "snippet": "Bitcoin posted its steepest drop in almost four months as traders moved to lock in profits following a more than 150% rally this year.",
        "highlighted_words": [
            "Bitcoin posted its steepest drop in almost four months"
        ],
        "position": 3,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Crypto market eyes interest rates and expected bitcoin ...",
        "snippet": "After ending 2023 on a high, crypto investors will be watching central bank interest rates and a U.S. regulatory decision on new bitcoin products as they ...",
        "highlighted_words": [
            "crypto investors will be watching central bank interest rates"
        ],
        "position": 4,
        "date": "Dec 11, 2023"
    },
    {
        "title": "BM&F Bitcoin Currency Futures (BITc1) News",
        "snippet": "Bitcoin (BTC) Price Takes Hit, But Brace Yourself for Real Pressure in 48 Hours. U.Today - In a dramatic turn of events, the crypto market witnessed a ...",
        "highlighted_words": [
            "Bitcoin (BTC) Price Takes Hit"
        ],
        "position": 5,
        "date": "Dec 11, 2023"
    },
    {
        "title": "$100K in 2024. $1m in 2030. Experts predict Bitcoin's future",
        "snippet": "The next Bitcoin halving is predicted to occur in early 2024, and with it another buying opportunity. This event happens roughly every four years.",
        "highlighted_words": [
            "The next Bitcoin halving is predicted to occur in early 2024"
        ],
        "position": 6,
        "date": "Dec 11, 2023"
    },
    {
        "title": "FASB Issues Standard to Improve the Accounting for and ...",
        "snippet": "The amendments in the ASU improve the accounting for certain crypto assets by requiring an entity to measure those crypto assets at fair value each reporting ...",
        "highlighted_words": [
            "crypto",
            "crypto"
        ],
        "position": 7,
        "date": "Dec 13, 2023"
    },
    {
        "title": "While Jamie Dimon bashes Bitcoin, JPMorgan's crypto empire ...",
        "snippet": "Jamie Dimon just bashed Bitcoin, again, saying that Congress should ban it. But JPMorgan's digital assets unit has quietly tripled its headcount in the last ...",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 8,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Leaving the Wild West: Taming Crypto and Unleashing ...",
        "snippet": "For one, crypto assets are not going away. Bitcoin is trading at its highest value since April 2022. The crypto market cap doubled over the last year. And still ...",
        "highlighted_words": [
            "Bitcoin is trading at its highest value since April 2022"
        ],
        "position": 9,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Investors lose millions as crypto schemes operate ...",
        "snippet": "Thousands of investors have lost millions of dollars in crypto investment schemes that have escaped regulator warnings in Australia, despite financial ...",
        "highlighted_words": [
            "Thousands of investors have lost millions of dollars in crypto investment schemes"
        ],
        "position": 10,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Over $300M in stolen crypto assets reached Bitcoin mixers ...",
        "snippet": "Data analyzed by CertiK shows that more than $300 million in the stolen proceeds from 50 of the largest exploits of 2023 ended up in Bitcoin.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 11,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Crypto News Today: Liquidations Spike as BTC Tumbles to ...",
        "snippet": "Bitcoin (BTC) tumbled to a Monday session low of $40,642 before steadying. US regulatory activity and BTC-spot ETF-related news remain focal points. Binance ...",
        "highlighted_words": [
            "Bitcoin (BTC) tumbled to a Monday session low of $40,642"
        ],
        "position": 12,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Why Was Bitcoin Created? | Crypto. ...",
        "snippet": "Innovations like Bitcoin mining have helped to incentivise the network's growth, while halving has controlled the currency's supply, ensuring scalability and ...",
        "highlighted_words": [
            "Bitcoin mining have helped to incentivise the network's growth"
        ],
        "position": 13,
        "date": "Dec 9, 2023"
    },
    {
        "title": "Where Does Jamie Dimon Stand on Crypto?",
        "snippet": "This week JPMorgan Chase (JPM) CEO Jamie Dimon expressed his opposition for cryptocurrencies and bitcoin at a Senate hearing, albeit not for the first time.",
        "highlighted_words": [
            "bitcoin"
        ],
        "position": 14,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Bitnomial Becomes First Crypto-Native Exchange to be ...",
        "snippet": "Bitnomial, a US-regulated digital asset derivatives exchange, today was granted a US clearinghouse license to clear margined digital asset futures and options ...",
        "highlighted_words": [
            "Bitnomial, a US-regulated digital asset derivatives exchange"
        ],
        "position": 15,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Two Men Charged for Operating $25M Cryptocurrency ...",
        "snippet": "A superseding indictment was unsealed yesterday charging an Australian national and a California man with operating a cryptocurrency Ponzi scheme that ...",
        "highlighted_words": [
            "Australian national and a California man"
        ],
        "position": 16,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Crypto News: Bitcoin Price, SOL Rally, ETH, PYTH, HNT ...",
        "snippet": "Crypto News: Bitcoin Price, SOL Rally, ETH, PYTH, HNT & MORE!! 90K views · 1 year ago #Cryptonews #Bitcoin #News ...more ...",
        "highlighted_words": [],
        "position": 17,
        "date": ""
    },
    {
        "title": "Bitcoin (BTC) Halving News",
        "snippet": "Bitcoin Nears Halving: Market Braces for $5 Billion Sell-Off and $122,000 Bull Target. 2 mins 1 year ago Apr 15, 2024. This Bitcoin Mining Stock Leads the ...",
        "highlighted_words": [
            "Bitcoin Nears Halving"
        ],
        "position": 18,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Bitcoin News - X",
        "snippet": "Two men, operating under the pseudonyms Bitcoin Yoda and Blue Wizard, have been accused by the US Department of Justice of stealing $25M in a series of scams.",
        "highlighted_words": [
            "Two men, operating under the pseudonyms Bitcoin Yoda and Blue Wizard"
        ],
        "position": 19,
        "date": ""
    },
    {
        "title": "Cryptocurrency mining News and Insights",
        "snippet": "Read the latest news and insights about Cryptocurrency mining from Microsoft's team of experts at Microsoft Security Blog.",
        "highlighted_words": [
            "Read the latest news and insights about Cryptocurrency mining"
        ],
        "position": 20,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Future of Financial Services | DTCC Digital Assets",
        "snippet": "Dan Doney, Chief Technology Officer, explains how blockchain enables transactions for cash, equities, and physical assets – all on the same platform. DTCC ...",
        "highlighted_words": [
            "Dan Doney, Chief Technology Officer"
        ],
        "position": 21,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Why Brazilian bank's embrace of Bitcoin is a lot like ... - DL News",
        "snippet": "Itaú Unibanco, the largest bank in Latin America, is rolling out Bitcoin and Ethereum trading for its customers.",
        "highlighted_words": [
            "Itaú Unibanco, the largest bank in Latin America"
        ],
        "position": 22,
        "date": "Dec 8, 2023"
    },
    {
        "title": "10 Best Bitcoin Stocks To Invest In",
        "snippet": "In this article, we discuss the best bitcoin stocks to invest in. If you want to skip our discussion on the bitcoin industry, head directly to 5 Best ...",
        "highlighted_words": [
            "best bitcoin stocks to invest in"
        ],
        "position": 23,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Bitcoin Has Been In A Class Of Its Own For The Last 10 ...",
        "snippet": "Bitcoin has encountered a critical resistance level going into the weekend and could move sideways following a massive rally. According to an expert, ...",
        "highlighted_words": [
            "Bitcoin has encountered a critical resistance level going into the weekend"
        ],
        "position": 24,
        "date": "Dec 8, 2023"
    },
    {
        "title": "FASB Publishes its First Direct Accounting Standard for ...",
        "snippet": "Currently, the crypto sector is reinvigorated — stemming from a recent run up in crypto prices, particularly with Bitcoin up more than 130% this year. Many ...",
        "highlighted_words": [
            "Bitcoin up more than 130% this year"
        ],
        "position": 25,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Press Releases",
        "snippet": "Blockstream has announced raising USD $125 million in convertible note and secured loan financing to expand its institutional bitcoin mining colocation ...",
        "highlighted_words": [
            "raising USD $125 million in convertible note and secured loan financing"
        ],
        "position": 26,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Crypto News Daily | Podcast on Spotify",
        "snippet": "Solaxy Presale Reaches 30 Million, SEC Delays Ether Staking Decision, Google Enforces Strict Crypto Ads, Institutions Boost Bitcoin Holdings, and more...",
        "highlighted_words": [
            "Solaxy Presale Reaches 30 Million"
        ],
        "position": 27,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Bitcoin's bounce 'still early innings'",
        "snippet": "Bitcoin's crypto winter appears to be thawing, bouncing to the $43,000-$46,000 range, up 159% from last December as tracked by Dow Jones Market Data Group.",
        "highlighted_words": [
            "Bitcoin's crypto winter appears to be thawing"
        ],
        "position": 28,
        "date": "Dec 10, 2023"
    },
    {
        "title": "River launches global Bitcoin payments over text",
        "snippet": "River (River.com), a leading Bitcoin technology and financial services company, launches River Link, enabling global Bitcoin payments via text message.",
        "highlighted_words": [
            "River (River.com), a leading Bitcoin technology and financial services company"
        ],
        "position": 29,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Bitcoin News",
        "snippet": "NEW: As wealth is passed from Boomers to younger generations, an incremental $20-$28M of daily buying pressure will enter the crypto market over the next ...",
        "highlighted_words": [
            "crypto"
        ],
        "position": 30,
        "date": ""
    },
    {
        "title": "Cryptocurrencies: Bitcoin Slips to $41K",
        "snippet": "This weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We've also included XRP.",
        "highlighted_words": [
            "bitcoin"
        ],
        "position": 31,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Bitcoin Depot (BTM) News Flow - Futubull",
        "snippet": "Top market news, company earnings, real-time market data and in-depth market analysis from Futubull.",
        "highlighted_words": [
            "Top market news"
        ],
        "position": 32,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Bitcoin Trades Above $41K, Ether Stays Below $2200 ...",
        "snippet": "3.0 TV is a news channel which gives you the latest news on blockchain and cryptocurrency on a daily basis which include Bitcoin (BTC), Ethereum, LUNA, UST, ...",
        "highlighted_words": [],
        "position": 33,
        "date": ""
    },
    {
        "title": "Bitcoin News - X",
        "snippet": "Cantor Fitzgerald CEO Howard Lutnick: \"I am a fan of crypto but let's be very specific - #Bitcoin - just Bitcoin\"",
        "highlighted_words": [
            "crypto",
            "Bitcoin",
            "Bitcoin"
        ],
        "position": 34,
        "date": ""
    },
    {
        "title": "Accounting for and Disclosure of Crypto Assets",
        "snippet": "On December 13, 2023, the Financial Accounting Standards Board (FASB) issued an Accounting Standards Update that addresses the accounting for and disclosure of ...",
        "highlighted_words": [],
        "position": 35,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Bitcoin Price Drops Below $41000 Amid Broader Market ...",
        "snippet": "The price of Bitcoin has briefly dropped below $41000, while Ethereum and more altcoins face market correction with XRP and Cardano down 5%.",
        "highlighted_words": [
            "The price of Bitcoin has briefly dropped below $41000"
        ],
        "position": 36,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Can Bitcoin Save the American Dream? Vivek Ramaswamy ...",
        "snippet": "Bitcoin can help rebuild the American dream in as a form of Digital hard money.",
        "highlighted_words": [],
        "position": 37,
        "date": ""
    },
    {
        "title": "Latest News on Egypt",
        "snippet": "Egyptian authorities have banned Bitcoin, as it is not covered by financial control laws. The technology of blockchain in Egypt is developing, with several ...",
        "highlighted_words": [
            "Egyptian authorities have banned Bitcoin"
        ],
        "position": 38,
        "date": "Dec 13, 2023"
    },
    {
        "title": "The INSANE Crypto Bull Market is Coming! - BIG NEWS!",
        "snippet": "The BIG crypto bull market 2024 is about to hit! Already the price of Bitcoin, Ethereum, Solana and many altcoins are starting to go ballistic!",
        "highlighted_words": [],
        "position": 39,
        "date": ""
    },
    {
        "title": "Brazil Leads in Crypto Adoption",
        "snippet": "The Latin American country earlier this year enforced a law that ensures the Brazilian Central Bank has regulatory oversight over the crypto economy.",
        "highlighted_words": [
            "crypto"
        ],
        "position": 40,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Coq Inu (COQ) Price Today, News & Live Chart",
        "snippet": "Coq Inu is a global digital currency exchange offering cryptocurrency trading, advanced tools, and staking options for beginners and experts alike.",
        "highlighted_words": [
            "cryptocurrency"
        ],
        "position": 41,
        "date": "3 hours ago"
    },
    {
        "title": "Supreme Court Transfers Over 40 FIRs Linked To Bitcoin ...",
        "snippet": "In a significant development, the Supreme Court Wednesday ordered transfer of over 40 FIRs related to the Bitcoin ... News · Tech · Weather · Health · TV Schedule ...",
        "highlighted_words": [
            "Bitcoin",
            "News"
        ],
        "position": 42,
        "date": "Dec 13, 2023"
    },
    {
        "title": "THIS ALTCOIN SEASON CAN MAKE YOU RICH!! Bitcoin ...",
        "snippet": "THIS ALTCOIN SEASON CAN MAKE YOU RICH!! Bitcoin News Today, Solana & Ethereum Price Prediction! *Register on Bybit* https://bit.ly/BybitJosh *(Up to ...",
        "highlighted_words": [],
        "position": 43,
        "date": ""
    },
    {
        "title": "GLOBAL BITCOIN ATM LEADER COINFLIP BRINGS ...",
        "snippet": "... OVER-THE-COUNTER CRYPTO PURCHASES. (PRNewsfoto/CoinFlip). News provided by. CoinFlip. Dec 13, 2023, 09:00 ET. Share this article. Share toX. Share this ...",
        "highlighted_words": [
            "CRYPTO",
            "News"
        ],
        "position": 44,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Text from a stranger leads to cryptocurrency scam costing ...",
        "snippet": "Cryptocurrency is more widely known, but still misunderstood costing consumers billions of dollars ... News · Business · Local Sports · Entertainment · Life.",
        "highlighted_words": [
            "Cryptocurrency",
            "News"
        ],
        "position": 45,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Cryptocurrency Prices, Charts, Daily Trends, Market Cap, ...",
        "snippet": "View crypto prices and charts, including Bitcoin, Ethereum, XRP, and more. Earn free crypto. Market highlights including top gainer, highest volume, ...",
        "highlighted_words": [
            "crypto",
            "Bitcoin",
            "crypto"
        ],
        "position": 46,
        "date": "Dec 14, 2023"
    },
    {
        "title": "How Bitcoin Improves Water Abundance In Water Scarce ...",
        "snippet": "In response to this news, a new attack vector has emerged: “Bitcoin uses too much water”. Apparently if Bitcoin uses fossil fuel as its energy source it is bad, ...",
        "highlighted_words": [
            "news",
            "Bitcoin",
            "Bitcoin"
        ],
        "position": 47,
        "date": "22 hours ago"
    },
    {
        "title": "Market Dip Indicates Deleveraging Rather than ...",
        "snippet": "Market Dip Indicates Deleveraging Rather than Fundamental News: Crypto Analyst. BitcoinCrypto Price Crash. Dec, 11, 2023. 2 min read. by Cryptonews.",
        "highlighted_words": [
            "News",
            "Crypto",
            "BitcoinCrypto"
        ],
        "position": 48,
        "date": "Dec 11, 2023"
    },
    {
        "title": "GMT price today, GMT to USD live price, marketcap and chart",
        "snippet": "Get the latest crypto news and latest trading insights with the CoinMarketCap blog. ... Bitcoin ETFs · Crypto API · DexScan · Global Charts · NFT · Portfolio ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 49,
        "date": "1 hour ago"
    },
    {
        "title": "Lithuanian authorities: requirements for crypto-asset ...",
        "snippet": "Lithuanian authorities: requirements for crypto-asset companies must be tightened immediately. Media · News. Print Newsletter RSS. 2023-12-12. Lithuanian ...",
        "highlighted_words": [
            "crypto",
            "News"
        ],
        "position": 50,
        "date": "Dec 12, 2023"
    },
    {
        "title": "How Regulators Tamed Crypto",
        "snippet": "Latest news updates are posted from time to time about matters which affect the financial services industry in Gibraltar.",
        "highlighted_words": [
            "news"
        ],
        "position": 51,
        "date": "Dec 11, 2023"
    },
    {
        "title": "1 Cryptocurrency to Avoid No Matter What",
        "snippet": "... Bitcoin (CRYPTO: BTC). Bitcoin's capped supply of 21 million has ... Mortgages Credit Cards Sectors Crypto Heatmap Financial News. ABOUT. Data ...",
        "highlighted_words": [
            "Bitcoin",
            "CRYPTO",
            "Bitcoin's",
            "Crypto",
            "News"
        ],
        "position": 52,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Bitcoin Price (AUD) Chart - Trade with Confidence",
        "snippet": "Bitcoin price · Price$148,208.14AUD · About Bitcoin (BTC) · Using Bitcoin (BTC) price information · Frequently asked questions · Find out the latest Bitcoin news.",
        "highlighted_words": [
            "Bitcoin news"
        ],
        "position": 53,
        "date": "Dec 11, 2023"
    },
    {
        "title": "What Is a Bitcoin Node? | Crypto.com",
        "snippet": "Likewise, a node 'reports' on new blocks emerging from mining efforts. Think of Bitcoin nodes as a 'Bitcoin News Network' of sorts: They communicate information ...",
        "highlighted_words": [
            "Bitcoin News"
        ],
        "position": 54,
        "date": "Dec 9, 2023"
    },
    {
        "title": "The 2024 Bitcoin Halving: Analyzing Past Trends to Predict ...",
        "snippet": "The second halving saw Bitcoin and crypto burst into the spotlight, with a ... Get Crypto Tips & News Straight to Your Inbox. First Name. Last Name. Email.",
        "highlighted_words": [
            "Bitcoin",
            "crypto",
            "Crypto",
            "News"
        ],
        "position": 55,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Bitcoin Price Today: Strong Correction? BTC Price News ...",
        "snippet": "... Bitcoin BTC Price News Today - Technical Analysis and Elliott Wave Analysis and Price Prediction! In this video I talk about the Bitcoin BTC Cryptocurrency ...",
        "highlighted_words": [],
        "position": 56,
        "date": ""
    },
    {
        "title": "Bears Take the Reins Clawing BTC's Price Back",
        "snippet": "... Bitcoin ATMCrypto FaucetsCrypto Tax. Products & Services. NewsLearning CenterWalletVerse DEXList in Wallet & MarketsBitcoin Cash Register. Spend Crypto. V-Card ...",
        "highlighted_words": [
            "Bitcoin",
            "Crypto",
            "Crypto",
            "News",
            "Bitcoin",
            "Crypto"
        ],
        "position": 57,
        "date": "Dec 11, 2023"
    },
    {
        "title": "16 Top Crypto News Websites (2025) - Web3 Wiki - Moralis",
        "snippet": "List of Top 16 Crypto News Websites · Real Vision · HumanDAO Academy · DeFi Pulse · NFT Evening · Metaschool · Capture the Ether · NonFungible · Ayzd. NFT ...",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 58,
        "date": "Dec 14, 2023"
    },
    {
        "title": "JP Morgan Crypto Team Up By 200%, Amid CEO's Bitcoin ...",
        "snippet": "Home / News / JP Morgan Grew Its Crypto Team By 200%, Amid CEO's Criticism Of Bitcoin. JP Morgan Grew Its Crypto Team By 200%, Amid CEO's Criticism Of Bitcoin.",
        "highlighted_words": [
            "News",
            "Crypto",
            "Bitcoin",
            "Crypto",
            "Bitcoin"
        ],
        "position": 59,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Bitcoin News",
        "snippet": "JUST IN: @ICOffenderII trolled the whole internet so bad with a fake NYT headline bashing #Bitcoin, that Reuters had to put out an official 'fact check' ...",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 60,
        "date": ""
    },
    {
        "title": "HTX theft: Crypto exchange suffers a $258 million net ...",
        "snippet": "World News · Subscribe · Home / World News / HTX theft: Crypto exchange suffers a $258 million net outflow after hack. HTX theft: Crypto exchange suffers a $258 ...",
        "highlighted_words": [
            "News",
            "News",
            "Crypto",
            "Crypto"
        ],
        "position": 61,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Coscoin: Former Nissan worker's life 'ruined' by app",
        "snippet": "Mark quit his job to become a WhatsApp group administrator for cryptocurrency app Coscoin.",
        "highlighted_words": [
            "cryptocurrency"
        ],
        "position": 62,
        "date": "Dec 12, 2023"
    },
    {
        "title": "The Bitcoin Halving: What You Need to Know",
        "snippet": "Explaining the halving, its significance, and its potential impact on the world of crypto - all about Bitcoin's four-year cycle. ... Hem / News and Analysis / ...",
        "highlighted_words": [
            "crypto",
            "Bitcoin's",
            "News"
        ],
        "position": 63,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Inscriptions: The Cure Is Worse Than The Disease",
        "snippet": "Inscriptions work by embedding images or other data into the bitcoin blockchain by using a trick in bitcoin script. ... news, information and thought leadership ...",
        "highlighted_words": [
            "bitcoin",
            "bitcoin",
            "news"
        ],
        "position": 64,
        "date": "Dec 12, 2023"
    },
    {
        "title": "JPMorgan says ether to outperform bitcoin next year",
        "snippet": "Ether will likely outperform bitcoin and other cryptocurrencies in 2024, according to JPMorgan analysts. ... The Block is a news provider that strives to be the ...",
        "highlighted_words": [
            "bitcoin",
            "news"
        ],
        "position": 65,
        "date": "Dec 13, 2023"
    },
    {
        "title": "El Salvador expects to sell out Bitcoin... - Belize Live News",
        "snippet": "El Salvador expects to sell out Bitcoin 'Freedom Visa' by end of year.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 66,
        "date": ""
    },
    {
        "title": "Ontario's 'Crypto King' owes investors millions. How is he still ...",
        "snippet": "... Canadians. Ontario's 'Crypto King' owes investors millions. How is he still living large? | About That. 1.3M views · 1 year ago ...more. CBC News. 4.17M.",
        "highlighted_words": [],
        "position": 67,
        "date": ""
    },
    {
        "title": "Bitcoin ATM company Coin Cloud got hacked. Even its new ...",
        "snippet": "Crypto has more recently also become short for cryptocurrency, such as Bitcoin ... TechCrunch Mobility is your destination for transportation news and insight.",
        "highlighted_words": [
            "Crypto",
            "cryptocurrency",
            "Bitcoin",
            "news"
        ],
        "position": 68,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Crypto Instagram Accounts to Follow in 2024",
        "snippet": "Crypto Instagram Accounts are a great way to learn about blockchain technology and stay current on the latest news in the crypto market.",
        "highlighted_words": [
            "Crypto",
            "news",
            "crypto"
        ],
        "position": 69,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Mantle Staked Ether METH Price",
        "snippet": "Get the latest crypto news, updates, and reports by subscribing to our free newsletter. Subscribe.",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 70,
        "date": "Dec 9, 2023"
    },
    {
        "title": "💥 LIVESTREAM: Crypto Market News, BTC Price, Memecoins ...",
        "snippet": "LIVESTREAM: Crypto Market News, BTC Price, Memecoins & MORE!! 18K views · Streamed 1 year ago #livestream #cryptocurrency #live ...more ...",
        "highlighted_words": [],
        "position": 71,
        "date": ""
    },
    {
        "title": "Concerns about Binance's BNB",
        "snippet": "Binance's BNB continues to face sell-offs due to worrying news. Regulatory pressure and CEO's resignation fuel the decline. Crypto analyst advises investors to ...",
        "highlighted_words": [
            "news",
            "Crypto"
        ],
        "position": 72,
        "date": "Dec 11, 2023"
    },
    {
        "title": "How “pig butchering” scams have emerged as a billion- ...",
        "snippet": "Regulators are finding more evidence of widespread \"pig butchering\" scams in the crypto industry that are leaving a trail of victims behind ... News & media ...",
        "highlighted_words": [
            "crypto",
            "News"
        ],
        "position": 73,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Noticias",
        "snippet": "Voltar ao menu. Notícias. Mercados · Finanças · Tecnologia · Política · Foco · Preços. Voltar ao menu. Preços. Dados. Voltar ao menu. Dados.",
        "highlighted_words": [],
        "position": 74,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Liquidation Heatmap: Bitcoin & Altcoins",
        "snippet": "Market News. Tools. Crypto Emission Rate Free · Bitcoin vs Gold Free · ETF & Companies Free · Liquidation Heatmap · Liquidation Profile · BTC Supplier Model.",
        "highlighted_words": [
            "News",
            "Crypto",
            "Bitcoin"
        ],
        "position": 75,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Bitcoin news - CoinSalary.my",
        "snippet": "Bitcoin Repetition of Pre-Halving Years' Patterns, According to Analyst. Crypto analyst Benjamin Cowen claimed in a recent YouTube video that the…",
        "highlighted_words": [
            "Bitcoin",
            "Crypto"
        ],
        "position": 76,
        "date": "Dec 13, 2023"
    },
    {
        "title": "Data of over a million crypto exchange users exposed",
        "snippet": "GokuMarket, a cryptocurrency exchange, was recently acquired by Canada-based crypto ... © 2025 Cybernews – Latest Cybersecurity and Tech News, Research & Analysis ...",
        "highlighted_words": [
            "cryptocurrency",
            "crypto",
            "News"
        ],
        "position": 77,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Mining Now: The Front Page of Crypto Mining",
        "snippet": "Subscribe to our newsletter and never miss any latest news! mining-now-logo · twitter · discord · telegram · Asic Miners · Coins · Glossary · Asic Deals · Media.",
        "highlighted_words": [
            "news"
        ],
        "position": 78,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Basics of Algorithmic Trading: Concepts and Examples",
        "snippet": "News. News. Markets · Companies · Earnings · CD Rates · Mortgage Rates · Economy · Government · Crypto · Live Markets News · Personal Finance · View All.",
        "highlighted_words": [
            "News",
            "News",
            "Crypto",
            "News"
        ],
        "position": 79,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Crypto Regulation News! The Battle Against Elizabeth Warren ...",
        "snippet": "... Bitcoin Interviews - https://youtube.com/playlist?list=PL5rDfH3ofGEcjtw8URfr7 ... The Thinking Crypto Podcast is your home for the best Crypto News and ...",
        "highlighted_words": [],
        "position": 80,
        "date": ""
    },
    {
        "title": "Bitcoin (BTC) CME Gap At $39700, Is A Market Correction ...",
        "snippet": "At CoinGape Media, Varinder leads the editorial decisions, spearheading the news team to cover latest updates, markets trends and developments within the crypto ...",
        "highlighted_words": [
            "news",
            "crypto"
        ],
        "position": 81,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Kumpulan Berita bitcoin - ANTARA ...",
        "snippet": "Kumpulan Berita bitcoin dari ANTARA News, portal berita terkini dan terpercaya Indonesia.",
        "highlighted_words": [
            "bitcoin",
            "News"
        ],
        "position": 82,
        "date": "Dec 13, 2023"
    },
    {
        "title": "2DAI.io Token Price, Charts & Market Insights",
        "snippet": "Stay updated with the latest 2DAI.io token price, charts, and market trends. Dive deep into comprehensive cryptocurrency news and insights on our platform.",
        "highlighted_words": [
            "cryptocurrency news"
        ],
        "position": 83,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Fidelity's Spot Bitcoin ETF Lands on DTCC Under Ticker ...",
        "snippet": "Coinpedia - Trusted Crypto Agency for News, Information, Exchange, PR, Blockchain Events, Crypto Wallet and Else related to Decentralized World.",
        "highlighted_words": [
            "Crypto",
            "News",
            "Crypto"
        ],
        "position": 84,
        "date": "Dec 8, 2023"
    },
    {
        "title": "UK police return £8 million in bitcoin stolen by chronically ...",
        "snippet": "... bitcoin to a man whose cryptocurrency was stolen back in 2017 ... He was previously a technology reporter for Sky News and is also a fellow at the European Cyber ...",
        "highlighted_words": [
            "bitcoin",
            "cryptocurrency",
            "News"
        ],
        "position": 85,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Bitcoin Ethereum Liquidation Heatmap Cryptocurrency ...",
        "snippet": "The Puell Multiple · Bitcoin Profit(%) · AltcoinSeason · BTC Price History · Pi Cycle Top Indicator · MVRV Z-Score · News. Pro Chart. Pro Chart · Live Chart.",
        "highlighted_words": [
            "Bitcoin",
            "News"
        ],
        "position": 86,
        "date": "Dec 9, 2023"
    },
    {
        "title": "Crypto Bulls and Cardano's Position With Rob From Digital ...",
        "snippet": "Live stream with Rob from Digital Asset News to talk all about everything that is going on in Crypto right now with a lot of people becoming bullish with ...",
        "highlighted_words": [],
        "position": 87,
        "date": ""
    },
    {
        "title": "Vodafone Idea Ltd (IDEA) Stock Price & News",
        "snippet": "iShares Bitcoin Trust ETF. 0.00% · Palantir Technologies Inc. 0.00% · settings ... India TV News. 7 hours ago. Jio, Airtel Soar, but BSNL and Vi bleed users ...",
        "highlighted_words": [
            "Bitcoin",
            "News"
        ],
        "position": 88,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Round Rock Fraudster Sentenced for Stealing More Than ...",
        "snippet": "title=\"News\" News · Press Releases · Speeches · Videos · Photo Galleries · Blogs ... $600,000 in cryptocurrency from dozens of victims nationwide. In addition to ...",
        "highlighted_words": [
            "News",
            "News",
            "cryptocurrency"
        ],
        "position": 89,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Breaking News: 🇵🇭 Philippines SEC Chairman Kelvin Lee c",
        "snippet": "Breaking News: Philippines SEC Chairman Kelvin Lee confirms Binance ban set to begin in March 2024, citing regulations against unlicensed crypto ...",
        "highlighted_words": [
            "News",
            "crypto"
        ],
        "position": 90,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Powder Horn Investment Advisory: Wealth Management ...",
        "snippet": "Crypto News · Mutuum Finance (MUTM): Accelerating DeFi Innovation with a Rapid ... With our help, you can invest in a range of asset classes—from stocks and bonds ...",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 91,
        "date": "2 hours ago"
    },
    {
        "title": "Crypto Regulation News! Patrick McHenry Retiring, Jamie ...",
        "snippet": "Ron Hammond of the Blockchain Association joins me to discuss: - Patrick McHenry retiring and impact on House crypto bills - Jamie Dimon & Elizabeth Warren ...",
        "highlighted_words": [],
        "position": 92,
        "date": ""
    },
    {
        "title": "Harga AirSwap Hari Ini | AST to IDR = 1.192",
        "snippet": "... Rollover Opsi Kripto Menandakan Kecenderungan Bullish Menuju Breakout Bitcoin US$100K | US Crypto News. BeinCrypto Indonesia ...",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 93,
        "date": "Dec 11, 2023"
    },
    {
        "title": "I was the OTHER Bitcoin pizza guy - I got 10k coins now ...",
        "snippet": "Bitcoin's richest trader loses $100m a day in crypto crash as $4bn wiped off ... ©News Group Newspapers Limited in England No. 679215 Registered office: 1 ...",
        "highlighted_words": [
            "Bitcoin's",
            "crypto",
            "News"
        ],
        "position": 94,
        "date": "Dec 12, 2023"
    },
    {
        "title": "Notizia",
        "snippet": "Torna al menu. Notizia. Mercati · Finanza · Tecnologia · Politiche · Messa a fuoco · Prezzi. Torna al menu. Prezzi. Dati. Torna al menu. Dati.",
        "highlighted_words": [],
        "position": 95,
        "date": "Dec 14, 2023"
    },
    {
        "title": "Cryptocurrencies had a calm weekend. Bitcoin was priced ...",
        "snippet": "News · Bookmarked and Liked · Creator Center · Settings. Explore the latest crypto news. ⚡️ Be a part of the latests discussions in crypto. Interact with your ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 96,
        "date": "Dec 11, 2023"
    },
    {
        "title": "Agenda | Money20/20 Asia",
        "snippet": "Call For Breaking News · Resources ... Digital Asset Workshop: From Bitcoin to Memecoin - the Evolution of Digital Asset and the next Emerging Asset Classes.",
        "highlighted_words": [
            "News",
            "Bitcoin"
        ],
        "position": 97,
        "date": "Dec 12, 2023"
    },
    {
        "title": "BITCOIN SPOT ETF APPOVAL DATE REVEALED! *THIS ...",
        "snippet": "... IN A BANK ACCOUNT! BITCOIN SPOT ETF APPOVAL DATE REVEALED! *THIS NEWS IS MENTAL*. 20K views · 1 year ago #cardano #tesla #stocks ...more. My Financial Friend.",
        "highlighted_words": [],
        "position": 98,
        "date": ""
    },
    {
        "title": "Presidency of Javier Milei",
        "snippet": "$Libra cryptocurrency scandal. edit. Main article: $Libra cryptocurrency ... BBC News. Archived from the original on 23 October 2023. Retrieved 11 ...",
        "highlighted_words": [
            "cryptocurrency",
            "cryptocurrency",
            "News"
        ],
        "position": 99,
        "date": "Dec 11, 2023"
    }
]