[
    {
        "title": "Crypto News Blog - Find out news from the cryptocurrency ...",
        "snippet": "Read the latest crypto news and stories about trading, investment and insights on Bitcoin Store blog, the most professional and trusted crypto news blog.",
        "highlighted_words": [
            "Read the latest crypto news"
        ],
        "position": 1,
        "date": "2023-12-17"
    },
    {
        "title": "Crypto winter fades as news and fundamentals point toward ...",
        "snippet": "Bitcoin is expected to reach its next “halving” event sometime between March and May 2024. This refers to a cut in the size of the reward paid to bitcoin miners ...",
        "highlighted_words": [
            "Bitcoin is expected to reach its next “halving” event sometime between March and May 2024"
        ],
        "position": 2,
        "date": "2023-12-22"
    },
    {
        "title": "What happened in crypto in 2023",
        "snippet": "Crypto 2023: Bitcoin prices started recovering and India was a significant player this year in the crypto sector. Here are just five compelling sagas which ...",
        "highlighted_words": [
            "Bitcoin prices started recovering"
        ],
        "position": 3,
        "date": "2023-12-22"
    },
    {
        "title": "J.P. Morgan Sees Bitcoin Fizzling Next Year, but This Other ...",
        "snippet": "Bitcoin and other cryptocurrencies have soared into the end of 2023, but investors are eyeing whether 2024 will usher in more gains for tokens should take ...",
        "highlighted_words": [
            "Bitcoin and other cryptocurrencies have soared into the end of 2023"
        ],
        "position": 4,
        "date": "2023-12-18"
    },
    {
        "title": "crypto",
        "snippet": "Latest crypto News ... With crypto scams growing more sophisticated, Chainalysis helps government agencies, law enforcement, and companies recover lost funds.",
        "highlighted_words": [
            "crypto scams growing more sophisticated"
        ],
        "position": 5,
        "date": "2023-12-20"
    },
    {
        "title": "Why bitcoin is up by almost 150% this year",
        "snippet": "Why bitcoin is up by almost 150% this year. Introducing the cockroach theory of crypto. Illustration: Satoshi Kambayashi.",
        "highlighted_words": [
            "Why bitcoin is up by almost 150% this year"
        ],
        "position": 6,
        "date": "2023-12-18"
    },
    {
        "title": "Latest Crypto Market News and Trends: Bitcoin, Ethereum ...",
        "snippet": "Don't miss a beat in crypto! Discover the latest news & trends in Bitcoin, Ethereum & more. Stay informed with our comprehensive coverage.",
        "highlighted_words": [
            "latest news & trends in Bitcoin"
        ],
        "position": 7,
        "date": "2023-12-18"
    },
    {
        "title": "Grayscale Report Sheds Light on Bitcoin's Broad ...",
        "snippet": "A new report from Grayscale Investments reveals that bitcoin ownership is more widely distributed than commonly believed.",
        "highlighted_words": [
            "bitcoin ownership is more widely distributed than commonly believed"
        ],
        "position": 8,
        "date": "2023-12-20"
    },
    {
        "title": "Crypto ETNs: Key building blocks",
        "snippet": "In our latest briefing, we explain the key structuring and legal issues that arise when establishing crypto exchange traded note programmes.",
        "highlighted_words": [
            "key structuring and legal issues that arise"
        ],
        "position": 9,
        "date": "2023-12-19"
    },
    {
        "title": "RSK (RBTC): What It Is and How It Works",
        "snippet": "RSK is an open-source second-layer sidechain that includes Bitcoin smart contracts, faster transaction times, scalability, and more.",
        "highlighted_words": [
            "RSK is an open-source second-layer sidechain"
        ],
        "position": 10,
        "date": "2023-12-16"
    },
    {
        "title": "Tether Confirms Extensive Collaboration With DOJ, FBI ...",
        "snippet": "Tether has confirmed it has collaborated extensively with U.S government agencies, including the DOJ, the FBI, and the Secret Service..",
        "highlighted_words": [
            "Tether has confirmed it has collaborated extensively with U.S government agencies"
        ],
        "position": 11,
        "date": "2023-12-17"
    },
    {
        "title": "An NYC bathhouse is mining Bitcoin to heat its pools—and ...",
        "snippet": "Bathhouse began mining Bitcoin on its premises in 2021, using miners as “fancy pool heaters” to generate cryptocurrency in addition to heat.",
        "highlighted_words": [
            "Bathhouse began mining Bitcoin on its premises in 2021"
        ],
        "position": 12,
        "date": "2023-12-21"
    },
    {
        "title": "Banking the unbanked: why emerging markets dominate ...",
        "snippet": "In 2023, crypto is increasingly being adopted by emerging and frontier markets, according to analyst firm Chainalysis.",
        "highlighted_words": [
            "crypto is increasingly being adopted by emerging and frontier markets"
        ],
        "position": 13,
        "date": "2023-12-19"
    },
    {
        "title": "Crypto Rover indicates potential Bitcoin-driven altcoin ...",
        "snippet": "Crypto Rover highlights parallels between current Bitcoin trends and the 2021 altcoin surge, sparking speculation.",
        "highlighted_words": [
            "current Bitcoin trends"
        ],
        "position": 14,
        "date": "2023-12-22"
    },
    {
        "title": "Qubic: Fastest. Blockchain. Ever - 15.5M TPS",
        "snippet": "Qubic is the fastest blockchain ever certified by Certik - 15.5M TPS. A decentralized network where unmatched scalable technology and artificial general ...",
        "highlighted_words": [
            "Qubic is the fastest blockchain ever certified by Certik - 15.5M TPS"
        ],
        "position": 15,
        "date": "2023-12-17"
    },
    {
        "title": "Michael Saylor Says Bitcoin ETFs Aren't a Threat to ...",
        "snippet": "Today in crypto: Michael Saylor argues MicroStrategy will remain an attractive option to BTC-exposure-seeking investors even if the US approves an ETF, ...",
        "highlighted_words": [
            "crypto",
            "BTC"
        ],
        "position": 16,
        "date": "2023-12-21"
    },
    {
        "title": "Braidpool: A Second Competitor In Decentralizing Mining",
        "snippet": "Braidpool is a protocol proposal for a completely decentralized mining pool, leaving no part of the pool's role the responsibility of a centralized actor.",
        "highlighted_words": [
            "Braidpool is a protocol proposal for a completely decentralized mining pool"
        ],
        "position": 17,
        "date": "prieš 22 valandas"
    },
    {
        "title": "Sui | Deliver the Benefits of Web3 with the Ease of Web2",
        "snippet": "Sui is a first-of-its-kind Layer 1 blockchain and smart contract platform designed to make digital asset ownership fast, private, secure, and accessible.",
        "highlighted_words": [
            "Sui"
        ],
        "position": 18,
        "date": "2023-12-21"
    },
    {
        "title": "Bitkub แพลตฟอร์มเทรดเหรียญดิจิทัลชั้นนำในไทย | Bitkub.com",
        "snippet": "Bitcoin ใกล้เริ่มเข้าสู่ขาขึ้นครั้งใหม่ และพร้อมทำสถิติสูงสุดตลอดกาลแล้ว. Siam Blockchain. 24 เม.ย. 68 · news.",
        "highlighted_words": [
            "Bitcoin",
            "news"
        ],
        "position": 19,
        "date": "2023-12-20"
    },
    {
        "title": "BarnBridge DAO settles with SEC for $1.7 million, agrees ...",
        "snippet": "BarnBridge DAO, which runs a small DeFi protocol, and its founders will pay more than $1.7 million to settle charges with the SEC.",
        "highlighted_words": [
            "BarnBridge DAO, which runs a small DeFi protocol"
        ],
        "position": 20,
        "date": "2023-12-22"
    },
    {
        "title": "MacroMicro",
        "snippet": "Combining tech and research expertise, MacroMicro empowers everyone to harness data and gain valuable insights into global market trends. MacroMicro.",
        "highlighted_words": [
            "MacroMicro"
        ],
        "position": 21,
        "date": "2023-12-21"
    },
    {
        "title": "Gareth Soloway: Gold, Silver, Bitcoin and More — Price ...",
        "snippet": "... news.your.trusted.source Follow us on Twitter: @INN_Resource. The Investing News Network ...",
        "highlighted_words": [],
        "position": 22,
        "date": ""
    },
    {
        "title": "Crypto Rover: Ethereum deemed oversold sparking market ...",
        "snippet": "Crypto Rover identifies Ethereum as oversold, drawing comparisons to 2020 market conditions that saw a bullish run.",
        "highlighted_words": [
            "Ethereum as oversold"
        ],
        "position": 23,
        "date": "2023-12-21"
    },
    {
        "title": "Frequently Asked Questions | FAQ",
        "snippet": "Find Frequently Asked Questions about Topstep, including: the Trading Combine, Express Funded Accounts, the Payout Policy, and more!",
        "highlighted_words": [],
        "position": 24,
        "date": "2023-12-16"
    },
    {
        "title": "A Cash App Debit Card with No Hidden Fees",
        "snippet": "Cash App Card is the instant discounts, no-hidden-fee, secure debit card that you design. Use it everywhere VISA is accepted. Free to order.",
        "highlighted_words": [
            "instant discounts, no-hidden-fee, secure debit card"
        ],
        "position": 25,
        "date": "2023-12-19"
    },
    {
        "title": "No Deposit Bonus Forex Account | Trade with $100 ...",
        "snippet": "Take advantage of our $100 no deposit bonus and start trading forex without risking your own money. Register now at Trading.com.",
        "highlighted_words": [],
        "position": 26,
        "date": "2023-12-18"
    },
    {
        "title": "FuelCell Energy, Inc. (FCEL) Stock Price, News, Quote & ...",
        "snippet": "Find the latest FuelCell Energy, Inc. (FCEL) stock quote, history, news and other vital information to help you with your stock trading and investing.",
        "highlighted_words": [
            "FuelCell Energy, Inc. (FCEL) stock quote, history, news"
        ],
        "position": 27,
        "date": "2023-12-20"
    },
    {
        "title": "Bold Text Generator | 𝕮𝖔𝖕𝖞 𝐚𝐧𝐝 𝗣𝗮𝘀𝘁𝗲 𝘽𝙤𝙡𝙙 𝙁𝙤𝙣𝙩",
        "snippet": "Copy and paste bold fonts (and italic bold text) for your social media posts, bios, instant messages, and more.",
        "highlighted_words": [
            "Copy and paste bold fonts"
        ],
        "position": 28,
        "date": "2023-12-19"
    }
]