[
    {
        "title": "What To Expect From Bitcoin and Crypto Markets In 2024",
        "snippet": "The approval of a spot Bitcoin ETF has been the key area of focus for crypto investors, as it could broaden access to Bitcoin.",
        "highlighted_words": [
            "Bitcoin",
            "crypto",
            "Bitcoin"
        ],
        "position": 1,
        "date": "Dec 4, 2023"
    },
    {
        "title": "The crypto industry is in the dumps. So why is bitcoin ...",
        "snippet": "Despite the woes of companies like FTX and Binance, bitcoin prices have surged 150% this year to top $40000. Here's why.",
        "highlighted_words": [
            "bitcoin"
        ],
        "position": 2,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Bitcoin rises above $42000 for first time since April 2022",
        "snippet": "Bitcoin rose on Monday, briefly surpassing $42000 to reach a 20-month high, in a new surge of momentum fueled by U.S. interest rate cut expectations and ...",
        "highlighted_words": [
            "Bitcoin rose on Monday, briefly surpassing $42000"
        ],
        "position": 3,
        "date": "19 hours ago"
    },
    {
        "title": "BM&F Bitcoin Currency Futures (BITc1) News",
        "snippet": "SHIB Holders Can Claim $500,000 Crypto Airdrop from Binance, DOGE Founder Unveils His BTC Stash, Samson Mow Says BTC Still Targets $1 Million: Crypto News ...",
        "highlighted_words": [
            "SHIB Holders Can Claim $500,000 Crypto Airdrop from Binance"
        ],
        "position": 4,
        "date": "Dec 8, 2023"
    },
    {
        "title": "What's behind the Bitcoin price surge? Has surpassed ...",
        "snippet": "Bitcoin soared past $41000 for the first time in over a year and a half — and marking a 150% rise so far this year.",
        "highlighted_words": [
            "Bitcoin soared past $41000"
        ],
        "position": 5,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Unveiling Bitcoin's Water Consumption with Alex de Vries",
        "snippet": "De Vries's research indicates that Bitcoin's water consumption will soon rival that of the entire traditional financial system.",
        "highlighted_words": [
            "Bitcoin's"
        ],
        "position": 6,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Why Bitcoin Prices Are Rising at the End of 2023 | Money",
        "snippet": "Bitcoin prices have seen big increases at year's end and they're soaring now. Here's what experts say about where crypto prices are going.",
        "highlighted_words": [
            "Bitcoin prices have seen big increases at year's end"
        ],
        "position": 7,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Gold and Bitcoin rise as bets on interest rates shift",
        "snippet": "Gold prices have hit a new high, while the value of Bitcoin has also surged. The gains come as traders switch investing strategies.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 8,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Why Are Crypto Prices Up? Former SEC Official Says ...",
        "snippet": "The U.S. Securities and Exchange Commission's former head of internet enforcement believes that there are two reasons why crypto prices are up.",
        "highlighted_words": [
            "there are two reasons why crypto prices are up"
        ],
        "position": 9,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Why Was Bitcoin Created? | Crypto. ...",
        "snippet": "The concept of Bitcoin first emerged in 2008, during an ongoing financial crisis. It aims to address perceived issues of trust and stability in traditional ...",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 10,
        "date": "Dec 9, 2023"
    },
    {
        "title": "Why Vanguard and State Street Are Sitting Out the Bitcoin ...",
        "snippet": "In this issue of the Bloomberg Crypto newsletter, Katie Greifeld explores some passive resistance to Bitcoin in the ETF industry.",
        "highlighted_words": [
            "passive resistance to Bitcoin"
        ],
        "position": 11,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Warning Signals Flash As Bitcoin Surges",
        "snippet": "Bitcoin (BTC), the world's leading cryptocurrency, has recently witnessed a surge in price, reaching a new yearly high of $42,100 on Monday.",
        "highlighted_words": [
            "Bitcoin (BTC), the world's leading cryptocurrency"
        ],
        "position": 12,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Why Brazilian bank's embrace of Bitcoin is a lot like ... - DL News",
        "snippet": "Itaú Unibanco, the largest bank in Latin America, is rolling out Bitcoin and Ethereum trading for its customers.",
        "highlighted_words": [
            "Itaú Unibanco, the largest bank in Latin America"
        ],
        "position": 13,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Jamie Dimon on the cryptocurrency industry: \"I'd close it ...",
        "snippet": "JPMorgan Chase CEO Jamie Dimon told lawmakers on Wednesday that he would pull the plug on the cryptocurrency industry if he had the power.",
        "highlighted_words": [
            "JPMorgan Chase CEO Jamie Dimon"
        ],
        "position": 14,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Bitcoin Mining Used More Water Than New York City Last ...",
        "snippet": "New estimates find billions of gallons needed to support cryptocurrency, fueling concerns about the environmental impact.",
        "highlighted_words": [
            "billions of gallons needed to support cryptocurrency"
        ],
        "position": 15,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Meanwhile Group Unveils First Bitcoin Private Credit Fund",
        "snippet": "The private credit fund aims to attract institutional investors seeking access to BTC's growth with an added conservative BTC-denominated yield.",
        "highlighted_words": [],
        "position": 16,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Blockchain Archives – Bitcoin News - Page 17",
        "snippet": "Vitalik Buterin Debates Over Blockchain Scaling Terminology ; Study: Only 6% of Crypto Exchanges Integrated the Lightning Network. Jan 02, 2024 ; Zimbabwean ...",
        "highlighted_words": [
            "Vitalik Buterin Debates Over Blockchain Scaling Terminology"
        ],
        "position": 17,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Bitcoin Returns To Hover Above $41000 Mark, Its 19- ...",
        "snippet": "The world's most popular cryptocurrency Bitcoin has bounced back and has returned to hover above its $41000 mark for the first time since May 2022.",
        "highlighted_words": [
            "Bitcoin has bounced back and has returned to hover above its $41000 mark"
        ],
        "position": 18,
        "date": "Dec 4, 2023"
    },
    {
        "title": "CEX.IO: Bitcoin & Cryptocurrency Exchange - Buy & Sell Crypto",
        "snippet": "It's an online platform and digital marketplace where eligible participants can check and compare cryptocurrency prices, buy and sell virtual currencies.",
        "highlighted_words": [
            "cryptocurrency"
        ],
        "position": 19,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Your Evening Briefing: Don't Look Now But Bitcoin Is Back",
        "snippet": "Bitcoin rose as much as 6.1% on Monday in New York, on track for the biggest annual gain since 2020. Smaller tokens such as Ether and meme-crowd favorite ...",
        "highlighted_words": [
            "Bitcoin rose as much as 6.1% on Monday in New York"
        ],
        "position": 20,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Crypto News: Bitcoin Rally, ETH Pump, USDT, Fed & MORE!!",
        "snippet": "#Crypto #News #Cryptonews #Bitcoin #ETF. Crypto News: Bitcoin Rally, ETH Pump, USDT, Fed & MORE!! 138K views · 1 year ago #Cryptonews #ETF #Bitcoin ...more ...",
        "highlighted_words": [],
        "position": 21,
        "date": ""
    },
    {
        "title": "Bitcoin Has Been In A Class Of Its Own For The Last 10 ...",
        "snippet": "According to an expert, the cryptocurrency has been breaching every major obstacle, making it one of the best-performing assets.",
        "highlighted_words": [
            "cryptocurrency has been breaching every major obstacle"
        ],
        "position": 22,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Bitcoin rally: Is El Salvador's Bitcoin bet paying off?",
        "snippet": "El Salvador's president is celebrating after a Bitcoin reserve he bought with public money has entered the black amid the continuing Bitcoin price rise.",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin"
        ],
        "position": 23,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Bitcoin price heads past $41500, extending yearly gains to ...",
        "snippet": "Bitcoin's price (BTC-USD) headed to its highest point since April last year on Monday, jumping 5.4% as it extended its year-to-date gains to more than 150%.",
        "highlighted_words": [
            "Bitcoin's price (BTC-USD) headed to its highest point since April last year on Monday"
        ],
        "position": 24,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Robinhood Stock Breaks Out After Bitcoin, Crypto Surge",
        "snippet": "Robinhood stock extended huge crypto-tied gains on Thursday, clearing a buy point amid plans to start Bitcoin trading in Europe.",
        "highlighted_words": [
            "Robinhood stock extended huge crypto-tied gains"
        ],
        "position": 25,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Bitcoin Depot (BTM) News Flow - Futubull",
        "snippet": "Top market news, company earnings, real-time market data and in-depth market analysis from Futubull.",
        "highlighted_words": [
            "Top market news"
        ],
        "position": 26,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Bitcoin's bounce 'still early innings'",
        "snippet": "Bitcoin's crypto winter appears to be thawing, bouncing to the $43,000-$46,000 range, up 159% from last December as tracked by Dow Jones Market Data Group.",
        "highlighted_words": [
            "Bitcoin's crypto winter appears to be thawing"
        ],
        "position": 27,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Crypto News Daily | Podcast on Spotify",
        "snippet": "Solaxy Presale Reaches 30 Million, SEC Delays Ether Staking Decision, Google Enforces Strict Crypto Ads, Institutions Boost Bitcoin Holdings, and more...",
        "highlighted_words": [
            "Solaxy Presale Reaches 30 Million"
        ],
        "position": 28,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Bitcoin Crosses $40000 First Time Since May 2022 Amidst ...",
        "snippet": "Rising by 2.9 per cent, reaching $40,867, the cryptocurrency showed a 146 per cent surge in 2023, Business Standard reported. This surge resurrected Bitcoin to ...",
        "highlighted_words": [
            "Rising by 2.9 per cent, reaching $40,867"
        ],
        "position": 29,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Where Does Jamie Dimon Stand on Crypto?",
        "snippet": "This week JPMorgan Chase (JPM) CEO Jamie Dimon expressed his opposition for cryptocurrencies and bitcoin at a Senate hearing, albeit not for the first time.",
        "highlighted_words": [
            "JPMorgan Chase (JPM) CEO Jamie Dimon"
        ],
        "position": 30,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Why Bitcoin has Value #bitcoin #bitcoinnews #bitcoinmining",
        "snippet": "FULL VIDEO: https://www.youtube.com/watch?v=ZKwqNgG-Sv4 Overview of the key insights behind Bitcoin. Covers the history of money, value, gold, blockchain, ...",
        "highlighted_words": [],
        "position": 31,
        "date": ""
    },
    {
        "title": "Dogecoin (@dogecoin) / X",
        "snippet": "Dogecoin is an open source peer-to-peer cryptocurrency, favored by shibas worldwide. Elon Musk thinks we're pretty cool.",
        "highlighted_words": [
            "e"
        ],
        "position": 32,
        "date": "Dec 8, 2023"
    },
    {
        "title": "What Is a Bitcoin Node? | Crypto.com",
        "snippet": "Essential to the Bitcoin network, nodes validate transactions, maintain the blockchain, and uphold the cryptocurrency's decentralised nature.",
        "highlighted_words": [
            "Bitcoin",
            "cryptocurrency's"
        ],
        "position": 33,
        "date": "Dec 9, 2023"
    },
    {
        "title": "Itaú Unibanco inicia negociação de criptomoedas via íon",
        "snippet": "Itaú Unibanco starts trading cryptocurrencies via íon. The bank's clients will have access to bitcoin and ether in a fluid, simplified and secure journey.",
        "highlighted_words": [
            "Itaú Unibanco starts trading cryptocurrencies via íon"
        ],
        "position": 34,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Founder and Majority Owner of Cryptocurrency Exchange ...",
        "snippet": "Founder and Majority Owner of Cryptocurrency Exchange Pleads Guilty to Unlicensed Money Transmitting. Wednesday, December 6, 2023. Share right ...",
        "highlighted_words": [
            "Cryptocurrency"
        ],
        "position": 35,
        "date": "Dec 6, 2023"
    },
    {
        "title": "JPMorgan CEO Jamie Dimon on crypto: If I was the ...",
        "snippet": "JP Morgan CEO Jamie Diamond lashing out of cryptocurrencies yesterday during a hearing on Capitol Hill suggesting they be banned.",
        "highlighted_words": [],
        "position": 36,
        "date": ""
    },
    {
        "title": "Bitcoin hovers near $44K; US Jobs data eyed | Morning News ...",
        "snippet": "3.0 TV is a news channel which gives you the latest news on blockchain and cryptocurrency on a daily basis which include Bitcoin (BTC), Ethereum, LUNA, UST, ...",
        "highlighted_words": [],
        "position": 37,
        "date": ""
    },
    {
        "title": "THIS ALTCOIN SEASON CAN MAKE YOU RICH!! Bitcoin ...",
        "snippet": "THIS ALTCOIN SEASON CAN MAKE YOU RICH!! Bitcoin News Today, Solana & Ethereum Price Prediction! Register on Bybit https://bit.ly/BybitJosh (Up to ...",
        "highlighted_words": [],
        "position": 38,
        "date": ""
    },
    {
        "title": "Coq Inu (COQ) Price Today, News & Live Chart",
        "snippet": "Coq Inu is a global digital currency exchange offering cryptocurrency trading, advanced tools, and staking options for beginners and experts alike.",
        "highlighted_words": [
            "Coq Inu is a global digital currency exchange"
        ],
        "position": 39,
        "date": "3 hours ago"
    },
    {
        "title": "Bitcoin crosses $40000 mark. Why is crypto rising again?",
        "snippet": "Bitcoin crosses $40,000 mark. Why is crypto rising again? Experts say this has been fuelled by expectations of the US Fed cutting interest rates in 2024 and the ...",
        "highlighted_words": [
            "Bitcoin crosses $40,000 mark"
        ],
        "position": 40,
        "date": "Dec 4, 2023"
    },
    {
        "title": "JAN3 Launches New Financial Division to Support Nation ...",
        "snippet": "... Bitcoin adoption, and will later offer more Bitcoin related products ... You may not always hear about these people buying Bitcoin on the news ...",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin",
            "Bitcoin",
            "news"
        ],
        "position": 41,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Bitcoin's Recent Rally Underscores the \"Low Correlation\" ...",
        "snippet": "He has also worked with some major crypto and DeFi projects as a content creator. Read More. Crypto News in numbers. editors. Authors List + 66 More.",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 42,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Text from a stranger leads to cryptocurrency scam costing ...",
        "snippet": "Cryptocurrency is more widely known, but still misunderstood costing consumers billions of dollars ... News · Business · Local Sports · Entertainment · Life.",
        "highlighted_words": [
            "Cryptocurrency",
            "News"
        ],
        "position": 43,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Bitcoin News",
        "snippet": "NEW: UAE-based #Bitcoin ⛏️ mining firm Phoenix Group PLC orders mining equipment valued at $136M, with an additional option worth $246M, from Whatsminer ...",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 44,
        "date": ""
    },
    {
        "title": "Bitcoin miner credits Medicine Hat start for new ...",
        "snippet": "... News on Wednesday. Sue Ennis is the head of investor relations at Hut 8. (CHAT News). Hut 8 first launched in 2018 with facilities in Medicine Hat and ...",
        "highlighted_words": [
            "News",
            "News"
        ],
        "position": 45,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Swiss city Lugano accepts Bitcoin and Tether for municipal ...",
        "snippet": "... cryptocurrency platform Bitcoin Suisse. ... Cointelegraph covers fintech, blockchain and Bitcoin bringing you the latest crypto news and analyses on the future of ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 46,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Tether Doubles Down on Bitcoin: $1.1 Billion Profit and ...",
        "snippet": "Coinpedia - Trusted Crypto Agency for News, Information, Exchange, PR, Blockchain Events, Crypto Wallet and Else related to Decentralized World.",
        "highlighted_words": [
            "Crypto",
            "News",
            "Crypto"
        ],
        "position": 47,
        "date": "Dec 5, 2023"
    },
    {
        "title": "The INSANE Crypto Bull Market is Coming! - BIG NEWS!",
        "snippet": "The BIG crypto bull market 2024 is about to hit! Already the price of Bitcoin, Ethereum, Solana and many altcoins are starting to go ballistic!",
        "highlighted_words": [],
        "position": 48,
        "date": ""
    },
    {
        "title": "Himachal Cryptocurrency Scam: Latest News, Photos ...",
        "snippet": "Rs 2,500 Crore Crypto Scam Key Accused Arrested By Himachal Pradesh Police ... The Himachal Pradesh Police has arrested one of the masterminds of a Rs 2,500-crore ...",
        "highlighted_words": [
            "Crypto"
        ],
        "position": 49,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Crypto News",
        "snippet": "Find and save ideas about crypto news on Pinterest ... Crypto Bitcoin · Cryptocurrency News · Bitcoin Cryptocurrency. Crypto news and more. Explore related ...",
        "highlighted_words": [
            "crypto news",
            "Cryptocurrency News",
            "Crypto news"
        ],
        "position": 50,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Robinhood Crypto",
        "snippet": "Zero-fee Bitcoin trading with no commissions and no added spreads from Robinhood Crypto. Sign up today and get €10 in crypto.*",
        "highlighted_words": [
            "Bitcoin",
            "Crypto",
            "crypto"
        ],
        "position": 51,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Bitcoin Bug: Peter Schiff Celebrates Gold ATH by Talking ...",
        "snippet": "Home / News / Crypto / Bitcoin (BTC) / Bitcoin Bug: Peter Schiff Celebrates Gold ATH by Talking About BTC Price Over $40K. News. 3 min read. Bitcoin Bug: Peter ...",
        "highlighted_words": [
            "News",
            "Crypto",
            "Bitcoin",
            "Bitcoin",
            "News",
            "Bitcoin"
        ],
        "position": 52,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Predicting Patterns: How Crypto Market Cycles Work",
        "snippet": "Market cycles are influenced by investor sentiment, corporate earnings, and market-specific news, but they are also affected by broader economic conditions.",
        "highlighted_words": [
            "news"
        ],
        "position": 53,
        "date": "Dec 7, 2023"
    },
    {
        "title": "El Salvador became the first country to accept Bitcoin as ...",
        "snippet": "... Bitcoin. In 2021, El Salvador became the first country to adopt Bitcoin as ... Mortgages Credit Cards Sectors Crypto Heatmap Financial News. ABOUT. Data ...",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin",
            "Crypto",
            "News"
        ],
        "position": 54,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Bitcoin TRC20 Price Chart (BTCT)",
        "snippet": "Track the latest Bitcoin TRC20 price, market cap, trading volume, news and more with CoinGecko's live BTCT price chart and popular cryptocurrency price ...",
        "highlighted_words": [
            "Bitcoin",
            "news",
            "cryptocurrency"
        ],
        "position": 55,
        "date": "Dec 5, 2023"
    },
    {
        "title": "The 2024 Bitcoin Halving: Analyzing Past Trends to Predict ...",
        "snippet": "The second halving saw Bitcoin and crypto burst into the spotlight, with a ... Get Crypto Tips & News Straight to Your Inbox. First Name. Last Name. Email.",
        "highlighted_words": [
            "Bitcoin",
            "crypto",
            "Crypto",
            "News"
        ],
        "position": 56,
        "date": "Dec 8, 2023"
    },
    {
        "title": "Crypto transactions are coming to an end",
        "snippet": "Latest news. Crypto transactions are coming to an end. The FSC, the regulator and license issuer for FXChoice, has barred the company from accepting deposits ...",
        "highlighted_words": [
            "news",
            "Crypto"
        ],
        "position": 57,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Top banker debates cryptocurrency use, requests ...",
        "snippet": "... News · Weather · Radar · Maps · Weather Cameras · Tower Cams · Weather Articles · Daily ... Bitcoin, one of the cryptocurrencies, is displayed on a · Charles W.",
        "highlighted_words": [
            "News",
            "Bitcoin"
        ],
        "position": 58,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Texas Bitcoin Mining Operation Shut Down By Host's ...",
        "snippet": "Established in 2012, Bitcoin Magazine is the oldest and most established source of trustworthy news, information and thought leadership on Bitcoin. FOLLOW ...",
        "highlighted_words": [
            "Bitcoin",
            "news",
            "Bitcoin"
        ],
        "position": 59,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Crypto Daily | Crypto News | Trading | If your friends don't ...",
        "snippet": "... don't believe in Bitcoin just send them this… . Follow @cryptodaily for daily News . . Bitcoin Cryptocurrency Blockchain Digital Currency BTC Crypto Bitcoin ...",
        "highlighted_words": [
            "Bitcoin",
            "News",
            "Bitcoin Cryptocurrency",
            "Crypto Bitcoin"
        ],
        "position": 60,
        "date": ""
    },
    {
        "title": "India Won't See Crypto or Web3 Bill for Another 18 Months ...",
        "snippet": "He also presents shows for CoinDesk TV on occasion. He has previously contributed to various news organizations such as CNN, Al Jazeera, Business Insider and ...",
        "highlighted_words": [
            "news"
        ],
        "position": 61,
        "date": "Dec 7, 2023"
    },
    {
        "title": "LCX Price, LCX Price, Live Charts, and Marketcap",
        "snippet": "The week's biggest crypto news, sent right to your inbox. Subscribe now. Learn ... What is Bitcoin? What is crypto? What is a blockchain? How to set up a ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 62,
        "date": "Dec 6, 2023"
    },
    {
        "title": "El Salvador's Bitcoin Investments Have Turned a Profit ...",
        "snippet": "Markets CoverageThe latest news & analysis. LIVE. Across the Markets · Economy · Streetwise · Stocks · Quick Takes · Market Data · Your Money · Newsletter ...",
        "highlighted_words": [
            "news"
        ],
        "position": 63,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Former SEC chair Jay Clayton: 'Tokenisation has huge ...",
        "snippet": "READ Ripple's legal chief says only bitcoin and XRP enjoy 'explicit regulatory clarity' ... SECTIONS. NewsLawAsset ManagementInvestment BankingWealth Management ...",
        "highlighted_words": [
            "bitcoin",
            "News"
        ],
        "position": 64,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Brazil's largest bank Itaú Unibanco launches Bitcoin trading",
        "snippet": "... Bitcoin trading — Report. News ... Cointelegraph covers fintech, blockchain and Bitcoin bringing you the latest crypto news and analyses on the future of money.",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 65,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Ontario's 'Crypto King' owes investors millions. How is he still ...",
        "snippet": "... Canadians. Ontario's 'Crypto King' owes investors millions. How is he still living large? | About That. 1.3M views · 1 year ago ...more. CBC News. 4.17M.",
        "highlighted_words": [],
        "position": 66,
        "date": ""
    },
    {
        "title": "Coq Inu price today, COQ to USD live price, marketcap ...",
        "snippet": "Don't have time to sift through endless crypto news? TLDR delivers quick, noise-free updates on top cryptos using AI. Contains unverified info, please DYOR ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 67,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Sandclock Price, Live QUARTZ Market Cap and Chart",
        "snippet": "Crypto News · Bitcoin · Altcoin · Ethereum News · Binance Coin News · Cardano News · Solana News · XRP News ... news in the crypto market. Name. E-Mail *. Check ...",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 68,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Block releases Bitkey hardware wallet to 95 countries ...",
        "snippet": "Ledger and Trezor also support other crypto assets beyond Bitcoin, which can ... TechCrunch Daily News. Every weekday and Sunday, you can get the best ...",
        "highlighted_words": [
            "crypto",
            "Bitcoin",
            "News"
        ],
        "position": 69,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Bitcoin Kurs | Bitcoin Kurs live in Euro | BTC EUR",
        "snippet": "News · News-Übersicht · Unternehmensmeldungen · Heute im Fokus · Experten-Kolumnen ... Währungsrechner: Bitcoin ➞ Euro (BTC in EUR). Bitcoin. 0. 0x. A. Aave ...",
        "highlighted_words": [
            "News",
            "News",
            "Bitcoin",
            "Bitcoin"
        ],
        "position": 70,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Aventus Price, AVT Price, Live Charts, and Marketcap",
        "snippet": "Finally, Aventus is becoming less newsworthy, with 0 news articles published about Aventus. ... Bitcoin Gold · KiloEx · TrustSwap · Soil.",
        "highlighted_words": [
            "news",
            "Bitcoin"
        ],
        "position": 71,
        "date": "Dec 6, 2023"
    },
    {
        "title": "What is Tether (USDT)?",
        "snippet": "Crypto is a volatile market, not every coin is built to handle everyday stability. Market movements rise and fall depending on the news of the day and this ...",
        "highlighted_words": [
            "Crypto",
            "news"
        ],
        "position": 72,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Bitcoin Price Today: $50,000 Next Stop? BTC Price News ...",
        "snippet": "... Bitcoin BTC Price News Today - Technical Analysis and Elliott Wave Analysis and Price Prediction! In this video I talk about the Bitcoin BTC Cryptocurrency ...",
        "highlighted_words": [],
        "position": 73,
        "date": ""
    },
    {
        "title": "XRP Initially Lagged in 2017 But Eventually Outpaced BTC ...",
        "snippet": "Sam Wisdom Raphael is a seasoned crypto news writer and journalist with 5 years of experience covering blockchain, DeFi, and crypto developments. Sam's active ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 74,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Most Comfortable Shoes for Everyday Wear · Atoms.com",
        "snippet": "... Bitcoin Development Fund atoms.com/bitcoin · Image · 463 Sep 7, 2021. Chris ... Stay in the know on product releases, founder news, and all things Atoms.",
        "highlighted_words": [
            "Bitcoin",
            "bitcoin",
            "news"
        ],
        "position": 75,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Bitcoin (BTC) CME Gap At $39700, Is A Market Correction ...",
        "snippet": "At CoinGape Media, Varinder leads the editorial decisions, spearheading the news team to cover latest updates, markets trends and developments within the crypto ...",
        "highlighted_words": [
            "news",
            "crypto"
        ],
        "position": 76,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Mantle Staked Ether METH Price",
        "snippet": "Get the latest crypto news, updates, and reports by subscribing to our free newsletter. Subscribe.",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 77,
        "date": "Dec 9, 2023"
    },
    {
        "title": "Satoshi's Mistake",
        "snippet": "Bitcoin BTC/USD ... Established in 2012, Bitcoin Magazine is the oldest and most established source of trustworthy news, information and thought leadership on ...",
        "highlighted_words": [
            "Bitcoin",
            "Bitcoin",
            "news"
        ],
        "position": 78,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Crypto Miner Phoenix Group's Shares Surge 35% in Abu ...",
        "snippet": "Jamie has been part of CoinDesk's news team since February 2021, focusing on breaking news, Bitcoin tech and protocols and crypto VC. He holds BTC, ETH and ...",
        "highlighted_words": [
            "news",
            "news",
            "Bitcoin",
            "crypto"
        ],
        "position": 79,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Rockstar Games Announces Grand Theft Auto VI, Coming ...",
        "snippet": "... news/home/20231204993583/en/. Grand Theft Auto VI coming 2025 to PlayStation 5 and Xbox ...",
        "highlighted_words": [
            "news"
        ],
        "position": 80,
        "date": "Dec 4, 2023"
    },
    {
        "title": "HNT to SAND Calculator | Convert Helium to The Sandbox",
        "snippet": "... News · Market Overview · Highlights · Currencies 51248; Exchanges 348; Transparency ... Also, you can calculate how much is bitcoin worth in exchange for a ...",
        "highlighted_words": [
            "News",
            "bitcoin"
        ],
        "position": 81,
        "date": "Dec 6, 2023"
    },
    {
        "title": "8 Green Candles: Here's What Happened To Bitcoin The ...",
        "snippet": "NewsBTC is a cryptocurrency news service that covers bitcoin news today, technical analysis & forecasts for bitcoin price and other altcoins. Here at ...",
        "highlighted_words": [
            "cryptocurrency news",
            "bitcoin news"
        ],
        "position": 82,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Crypto.com secures Electronic Money Institution license ...",
        "snippet": "... crypto news every weekday. Prior to joining The Block in 2022, James spent ... James' coverage spans everything from Bitcoin and Ethereum to Layer 2 ...",
        "highlighted_words": [
            "crypto news"
        ],
        "position": 83,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Crypto Regulation News! Patrick McHenry Retiring, Jamie ...",
        "snippet": "Ron Hammond of the Blockchain Association joins me to discuss: - Patrick McHenry retiring and impact on House crypto bills - Jamie Dimon & Elizabeth Warren ...",
        "highlighted_words": [],
        "position": 84,
        "date": ""
    },
    {
        "title": "2DAI.io Token Price, Charts & Market Insights",
        "snippet": "Stay updated with the latest 2DAI.io token price, charts, and market trends. Dive deep into comprehensive cryptocurrency news and insights on our platform.",
        "highlighted_words": [
            "cryptocurrency news"
        ],
        "position": 85,
        "date": "Dec 10, 2023"
    },
    {
        "title": "Crypto Analyst Sheds Light On When The XRP Price Will ...",
        "snippet": "Neither the BIS nor IMF about any ongoing NDAs w/ Ripple. This news will be sudden. When the information comes out it will already be too late. And most of you ...",
        "highlighted_words": [
            "news"
        ],
        "position": 86,
        "date": "Dec 5, 2023"
    },
    {
        "title": "I spent all my Bitcoin on two pizzas - I had no idea crypto ...",
        "snippet": "... News Group Newspapers Limited. This service is provided on News Group Newspapers' Limited's Standard Terms and Conditions in accordance with our Privacy ...",
        "highlighted_words": [
            "News",
            "News"
        ],
        "position": 87,
        "date": "Dec 7, 2023"
    },
    {
        "title": "HNT to IOTA Calculator | Convert Helium to IOTA",
        "snippet": "... News · Market Overview · Highlights · Currencies 51248; Exchanges 348; Transparency ... Also, you can calculate how much is bitcoin worth in exchange for a ...",
        "highlighted_words": [
            "News",
            "bitcoin"
        ],
        "position": 88,
        "date": "Dec 6, 2023"
    },
    {
        "title": "Bitcoin Ethereum Liquidation Heatmap Cryptocurrency ...",
        "snippet": "The Puell Multiple · Bitcoin Profit(%) · AltcoinSeason · BTC Price History · Pi Cycle Top Indicator · MVRV Z-Score · News. Pro Chart. Pro Chart · Live Chart.",
        "highlighted_words": [
            "Bitcoin",
            "News"
        ],
        "position": 89,
        "date": "Dec 9, 2023"
    },
    {
        "title": "Encryption",
        "snippet": "This method is called crypto-shredding. An example implementation of this ... The Hacker News. ^ Sheffer, Y.; Holz, R.; Saint-Andre, P. (February 2015) ...",
        "highlighted_words": [
            "crypto",
            "News"
        ],
        "position": 90,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Essential Bitcoin Mining News BTC hodlers need to know this!",
        "snippet": "Bitcoin mining is becoming super profitable as Bitcoin continues to increase in price but the Bitcoin mining landscape is rapidly changing, so what are the ...",
        "highlighted_words": [],
        "position": 91,
        "date": ""
    },
    {
        "title": "Adcentrx Announces Extension of Series A+ Financing to ...",
        "snippet": "Close submenu (News in Focus)News in Focus. Browse All News · Multimedia ... Cryptocurrency · Dividends · Earnings · Earnings Forecasts & Projections · Financing ...",
        "highlighted_words": [
            "News",
            "News",
            "News",
            "Cryptocurrency"
        ],
        "position": 92,
        "date": "Dec 5, 2023"
    },
    {
        "title": "Powder Horn Investment Advisory: Wealth Management ...",
        "snippet": "Crypto News · Mutuum Finance (MUTM): Accelerating DeFi Innovation with a Rapid ... With our help, you can invest in a range of asset classes—from stocks and bonds ...",
        "highlighted_words": [
            "Crypto News"
        ],
        "position": 93,
        "date": "2 hours ago"
    },
    {
        "title": "Provident Financial Services Inc reports results for the ...",
        "snippet": "Provident Financial Services Inc reports results for the quarter ended March 31 - Earnings Summary · Realtime news · More news from Reuters.",
        "highlighted_words": [
            "news",
            "news"
        ],
        "position": 94,
        "date": "Dec 4, 2023"
    },
    {
        "title": "Bitcoin Price Today: Breakout Above $41,000! BTC Price ...",
        "snippet": "... Bitcoin BTC Price News Today - Technical Analysis and Elliott Wave Analysis and Price Prediction! In this video I talk about the Bitcoin BTC Cryptocurrency ...",
        "highlighted_words": [],
        "position": 95,
        "date": ""
    },
    {
        "title": "Kryptowährungen: Aktuelle Kurse, Entwicklung und News",
        "snippet": "Kryptowährung, Aktueller Kurs, Entwicklung (24h). Bitcoin CashBCHKrypto, 317,02 EUR, -4,25%. ChainlinkLINKKrypto, 13,16 EUR, -1,35%.",
        "highlighted_words": [
            "Bitcoin"
        ],
        "position": 96,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Advanced Technology International to manage ...",
        "snippet": "Advanced Technology International to manage Expeditionary Missions Consortium - Crane OTA. ATI company logo (PRNewsfoto/ATI). News provided by.",
        "highlighted_words": [
            "News"
        ],
        "position": 97,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Day Trade",
        "snippet": "Disponibilizamos as seguintes plataformas para te ajudar nisso: Trading News, Valor Pro, Kinvo e TradeMap. Negociação. Como cliente BTG Pactual, você pode ...",
        "highlighted_words": [
            "News"
        ],
        "position": 98,
        "date": "Dec 7, 2023"
    },
    {
        "title": "Gold Fear and Greed Index",
        "snippet": "Bitcoin Price Charts · Gold Fear & Greed Index. IRA. IRA Program · Popular IRA ... Market News · FAQ · Track an Order · Sales Tax by State · Investing Guide.",
        "highlighted_words": [
            "Bitcoin",
            "News"
        ],
        "position": 99,
        "date": "Dec 8, 2023"
    }
]